apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/****************************************************************************
 * arch/arm/src/ra8m1/hardware/ra8m1_sci.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SCI_H
#define __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SCI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"
#include "hardware/ra8m1_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define R_SCI_B_RDR_OFFSET                  0x0000  /* Received Data Register (32-bits) */
#define R_SCI_B_TDR_OFFSET                  0x0004  /* Transmission Data Register (32-bits) */
#define R_SCI_B_TDR_HA_L_OFFSET             0x0004  /* Transmission Data Register (16-bits) */
#define R_SCI_B_TDR_BY_LL_OFFSET            0x0004  /* Transmission Data Register (8-bits) */
#define R_SCI_B_TDR_BY_LH_OFFSET            0x0005  /* Transmission Data Register (8-bits) */
#define R_SCI_B_CCR0_OFFSET                 0x0008  /* Common Control Register 0 (32-bits) */
#define R_SCI_B_CCR0_HA_L_OFFSET            0x0008  /* Common Control Register 0 (16-bits) */
#define R_SCI_B_CCR0_BY_LL_OFFSET           0x0008  /* Common Control Register 0 (8-bits) */
#define R_SCI_B_CCR0_BY_LH_OFFSET           0x0009  /* Common Control Register 0 (8-bits) */
#define R_SCI_B_CCR0_HA_H_OFFSET            0x000a  /* Common Control Register 0 (16-bits) */
#define R_SCI_B_CCR0_BY_HL_OFFSET           0x000a  /* Common Control Register 0 (8-bits) */
#define R_SCI_B_CCR0_BY_HH_OFFSET           0x000b  /* Common Control Register 0 (8-bits) */
#define R_SCI_B_CCR1_OFFSET                 0x000c  /* Common Control Register 1 (32-bits) */
#define R_SCI_B_CCR1_HA_L_OFFSET            0x000c  /* Common Control Register 1 (16-bits) */
#define R_SCI_B_CCR1_BY_LL_OFFSET           0x000c  /* Common Control Register 1 (8-bits) */
#define R_SCI_B_CCR1_BY_LH_OFFSET           0x000d  /* Common Control Register 1 (8-bits) */
#define R_SCI_B_CCR1_HA_H_OFFSET            0x000e  /* Common Control Register 1 (16-bits) */
#define R_SCI_B_CCR1_BY_HL_OFFSET           0x000e  /* Common Control Register 1 (8-bits) */
#define R_SCI_B_CCR1_BY_HH_OFFSET           0x000f  /* Common Control Register 1 (8-bits) */
#define R_SCI_B_CCR2_OFFSET                 0x0010  /* Common Control Register 2 (32-bits) */
#define R_SCI_B_CCR2_HA_L_OFFSET            0x0010  /* Common Control Register 2 (16-bits) */
#define R_SCI_B_CCR2_BY_LL_OFFSET           0x0010  /* Common Control Register 2 (8-bits) */
#define R_SCI_B_CCR2_BY_LH_OFFSET           0x0011  /* Common Control Register 2 (8-bits) */
#define R_SCI_B_CCR2_HA_H_OFFSET            0x0012  /* Common Control Register 2 (16-bits) */
#define R_SCI_B_CCR2_BY_HL_OFFSET           0x0012  /* Common Control Register 2 (8-bits) */
#define R_SCI_B_CCR2_BY_HH_OFFSET           0x0013  /* Common Control Register 2 (8-bits) */
#define R_SCI_B_CCR3_OFFSET                 0x0014  /* Common Control Register 3 (32-bits) */
#define R_SCI_B_CCR3_HA_L_OFFSET            0x0014  /* Common Control Register 3 (16-bits) */
#define R_SCI_B_CCR3_BY_LL_OFFSET           0x0014  /* Common Control Register 3 (8-bits) */
#define R_SCI_B_CCR3_BY_LH_OFFSET           0x0015  /* Common Control Register 3 (8-bits) */
#define R_SCI_B_CCR3_HA_H_OFFSET            0x0016  /* Common Control Register 3 (16-bits) */
#define R_SCI_B_CCR3_BY_HL_OFFSET           0x0016  /* Common Control Register 3 (8-bits) */
#define R_SCI_B_CCR3_BY_HH_OFFSET           0x0017  /* Common Control Register 3 (8-bits) */
#define R_SCI_B_CCR4_OFFSET                 0x0018  /* Common Control Register 4 (32-bits) */
#define R_SCI_B_CCR4_HA_L_OFFSET            0x0018  /* Common Control Register 4 (16-bits) */
#define R_SCI_B_CCR4_BY_LL_OFFSET           0x0018  /* Common Control Register 4 (8-bits) */
#define R_SCI_B_CCR4_BY_LH_OFFSET           0x0019  /* Common Control Register 4 (8-bits) */
#define R_SCI_B_CCR4_HA_H_OFFSET            0x001a  /* Common Control Register 4 (16-bits) */
#define R_SCI_B_CCR4_BY_HL_OFFSET           0x001a  /* Common Control Register 4 (8-bits) */
#define R_SCI_B_CCR4_BY_HH_OFFSET           0x001b  /* Common Control Register 4 (8-bits) */
#define R_SCI_B_CESR_OFFSET                 0x001c  /* Communication Enable Status Register (8-bits) */
#define R_SCI_B_HCR_OFFSET                  0x001e  /* HBS valid mode Control Register (8-bits) */
#define R_SCI_B_ICR_OFFSET                  0x0020  /* Simple-I2C Control Register (32-bits) */
#define R_SCI_B_ICR_HA_L_OFFSET             0x0020  /* Simple-I2C Control Register (16-bits) */
#define R_SCI_B_ICR_BY_LL_OFFSET            0x0020  /* Simple-I2C Control Register (8-bits) */
#define R_SCI_B_ICR_BY_LH_OFFSET            0x0021  /* Simple-I2C Control Register (8-bits) */
#define R_SCI_B_ICR_HA_H_OFFSET             0x0022  /* Simple-I2C Control Register (16-bits) */
#define R_SCI_B_ICR_BY_HL_OFFSET            0x0022  /* Simple-I2C Control Register (8-bits) */
#define R_SCI_B_FCR_OFFSET                  0x0024  /* FIFO Control Register (32-bits) */
#define R_SCI_B_FCR_HA_L_OFFSET             0x0024  /* FIFO Control Register (16-bits) */
#define R_SCI_B_FCR_BY_LL_OFFSET            0x0024  /* FIFO Control Register (8-bits) */
#define R_SCI_B_FCR_BY_LH_OFFSET            0x0025  /* FIFO Control Register (8-bits) */
#define R_SCI_B_FCR_HA_H_OFFSET             0x0026  /* FIFO Control Register (16-bits) */
#define R_SCI_B_FCR_BY_HL_OFFSET            0x0026  /* FIFO Control Register (8-bits) */
#define R_SCI_B_FCR_BY_HH_OFFSET            0x0027  /* FIFO Control Register (8-bits) */
#define R_SCI_B_MCR_OFFSET                  0x002c  /* Manchester Control Register (32-bits) */
#define R_SCI_B_MCR_HA_L_OFFSET             0x002c  /* Manchester Control Register (16-bits) */
#define R_SCI_B_MCR_BY_LL_OFFSET            0x002c  /* Manchester Control Register (8-bits) */
#define R_SCI_B_MCR_BY_LH_OFFSET            0x002d  /* Manchester Control Register (8-bits) */
#define R_SCI_B_MCR_HA_H_OFFSET             0x002e  /* Manchester Control Register (16-bits) */
#define R_SCI_B_MCR_BY_HL_OFFSET            0x002e  /* Manchester Control Register (8-bits) */
#define R_SCI_B_MCR_BY_HH_OFFSET            0x002f  /* Manchester Control Register (8-bits) */
#define R_SCI_B_DCR_OFFSET                  0x0030  /* Driver Control Register (32-bits) */
#define R_SCI_B_DCR_HA_L_OFFSET             0x0030  /* Driver Control Register (16-bits) */
#define R_SCI_B_DCR_BY_LL_OFFSET            0x0030  /* Driver Control Register (8-bits) */
#define R_SCI_B_DCR_BY_LH_OFFSET            0x0031  /* Driver Control Register (8-bits) */
#define R_SCI_B_DCR_HA_H_OFFSET             0x0032  /* Driver Control Register (16-bits) */
#define R_SCI_B_DCR_BY_HL_OFFSET            0x0032  /* Driver Control Register (8-bits) */
#define R_SCI_B_XCR0_OFFSET                 0x0034  /* Simple-LIN(SCIX) Control Register 0 (32-bits) */
#define R_SCI_B_XCR0_HA_L_OFFSET            0x0034  /* Simple-LIN(SCIX) Control Register 0 (16-bits) */
#define R_SCI_B_XCR0_BY_LL_OFFSET           0x0034  /* Simple-LIN(SCIX) Control Register 0 (8-bits) */
#define R_SCI_B_XCR0_BY_LH_OFFSET           0x0035  /* Simple-LIN(SCIX) Control Register 0 (8-bits) */
#define R_SCI_B_XCR0_HA_H_OFFSET            0x0036  /* Simple-LIN(SCIX) Control Register 0 (16-bits) */
#define R_SCI_B_XCR0_BY_HL_OFFSET           0x0036  /* Simple-LIN(SCIX) Control Register 0 (8-bits) */
#define R_SCI_B_XCR0_BY_HH_OFFSET           0x0037  /* Simple-LIN(SCIX) Control Register 0 (8-bits) */
#define R_SCI_B_XCR1_OFFSET                 0x0038  /* Simple-LIN(SCIX) Control Register 1 (32-bits) */
#define R_SCI_B_XCR1_HA_L_OFFSET            0x0038  /* Simple-LIN(SCIX) Control Register 1 (16-bits) */
#define R_SCI_B_XCR1_BY_LL_OFFSET           0x0038  /* Simple-LIN(SCIX) Control Register 1 (8-bits) */
#define R_SCI_B_XCR1_BY_LH_OFFSET           0x0039  /* Simple-LIN(SCIX) Control Register 1 (8-bits) */
#define R_SCI_B_XCR1_HA_H_OFFSET            0x003a  /* Simple-LIN(SCIX) Control Register 1 (16-bits) */
#define R_SCI_B_XCR1_BY_HL_OFFSET           0x003a  /* Simple-LIN(SCIX) Control Register 1 (8-bits) */
#define R_SCI_B_XCR1_BY_HH_OFFSET           0x003b  /* Simple-LIN(SCIX) Control Register 1 (8-bits) */
#define R_SCI_B_XCR2_OFFSET                 0x003c  /* Simple-LIN(SCIX) Control Register 2 (32-bits) */
#define R_SCI_B_XCR2_HA_L_OFFSET            0x003c  /* Simple-LIN(SCIX) Control Register 2 (16-bits) */
#define R_SCI_B_XCR2_BY_LL_OFFSET           0x003c  /* Simple-LIN(SCIX) Control Register 2 (8-bits) */
#define R_SCI_B_XCR2_BY_LH_OFFSET           0x003d  /* Simple-LIN(SCIX) Control Register 2 (8-bits) */
#define R_SCI_B_XCR2_HA_H_OFFSET            0x003e  /* Simple-LIN(SCIX) Control Register 2 (16-bits) */
#define R_SCI_B_XCR2_BY_HL_OFFSET           0x003e  /* Simple-LIN(SCIX) Control Register 2 (8-bits) */
#define R_SCI_B_XCR2_BY_HH_OFFSET           0x003f  /* Simple-LIN(SCIX) Control Register 2 (8-bits) */
#define R_SCI_B_CSR_OFFSET                  0x0048  /* Common Status Register (32-bits) */
#define R_SCI_B_ISR_OFFSET                  0x004c  /* Simple-I2C Status Register (32-bits) */
#define R_SCI_B_FRSR_OFFSET                 0x0050  /* FIFO Receive Status Register (32-bits) */
#define R_SCI_B_FTSR_OFFSET                 0x0054  /* FIFO Transmit Status Register (32-bits) */
#define R_SCI_B_MSR_OFFSET                  0x0058  /* Manchester Status Register (32-bits) */
#define R_SCI_B_XSR0_OFFSET                 0x005c  /* Simple-LIN(SCIX) Status Register 0 (32-bits) */
#define R_SCI_B_XSR1_OFFSET                 0x0060  /* Simple-LIN(SCIX) Status Register 1 (32-bits) */
#define R_SCI_B_CFCLR_OFFSET                0x0068  /* Common Flag Clear Register (32-bits) */
#define R_SCI_B_CFCLR_HA_L_OFFSET           0x0068  /* Common Flag Clear Register (16-bits) */
#define R_SCI_B_CFCLR_BY_LL_OFFSET          0x0068  /* Common Flag Clear Register (8-bits) */
#define R_SCI_B_CFCLR_HA_H_OFFSET           0x006a  /* Common Flag Clear Register (16-bits) */
#define R_SCI_B_CFCLR_BY_HL_OFFSET          0x006a  /* Common Flag Clear Register (8-bits) */
#define R_SCI_B_CFCLR_BY_HH_OFFSET          0x006b  /* Common Flag Clear Register (8-bits) */
#define R_SCI_B_ICFCLR_OFFSET               0x006c  /* Simple-I2C Flag Clear Register (32-bits) */
#define R_SCI_B_ICFCLR_HA_L_OFFSET          0x006c  /* Simple-I2C Flag Clear Register (16-bits) */
#define R_SCI_B_ICFCLR_BY_LL_OFFSET         0x006c  /* Simple-I2C Flag Clear Register (8-bits) */
#define R_SCI_B_FFCLR_OFFSET                0x0070  /* FIFO Flag Clear Register (32-bits) */
#define R_SCI_B_FFCLR_HA_L_OFFSET           0x0070  /* FIFO Flag Clear Register (16-bits) */
#define R_SCI_B_FFCLR_BY_LL_OFFSET          0x0070  /* FIFO Flag Clear Register (8-bits) */
#define R_SCI_B_MFCLR_OFFSET                0x0074  /* Manchester Flag Clear Register (32-bits) */
#define R_SCI_B_MFCLR_HA_L_OFFSET           0x0074  /* Manchester Flag Clear Register (16-bits) */
#define R_SCI_B_MFCLR_BY_LL_OFFSET          0x0074  /* Manchester Flag Clear Register (8-bits) */
#define R_SCI_B_XFCLR_OFFSET                0x0078  /* Simpe-LIN(SCIX) Flag Clear Register (32-bits) */
#define R_SCI_B_XFCLR_HA_L_OFFSET           0x0078  /* Simpe-LIN(SCIX) Flag Clear Register (16-bits) */
#define R_SCI_B_XFCLR_BY_LH_OFFSET          0x0079  /* Simpe-LIN(SCIX) Flag Clear Register (8-bits) */

