apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* Register Addresses *******************************************************/

/* SCI_B0 Registers */

#define R_SCI_B0_RDR                       (R_SCI_B0_BASE + R_SCI_B_RDR_OFFSET)
#define R_SCI_B0_TDR                       (R_SCI_B0_BASE + R_SCI_B_TDR_OFFSET)
#define R_SCI_B0_TDR_HA_L                  (R_SCI_B0_BASE + R_SCI_B_TDR_HA_L_OFFSET)
#define R_SCI_B0_TDR_BY_LL                 (R_SCI_B0_BASE + R_SCI_B_TDR_BY_LL_OFFSET)
#define R_SCI_B0_TDR_BY_LH                 (R_SCI_B0_BASE + R_SCI_B_TDR_BY_LH_OFFSET)
#define R_SCI_B0_CCR0                      (R_SCI_B0_BASE + R_SCI_B_CCR0_OFFSET)
#define R_SCI_B0_CCR0_HA_L                 (R_SCI_B0_BASE + R_SCI_B_CCR0_HA_L_OFFSET)
#define R_SCI_B0_CCR0_BY_LL                (R_SCI_B0_BASE + R_SCI_B_CCR0_BY_LL_OFFSET)
#define R_SCI_B0_CCR0_BY_LH                (R_SCI_B0_BASE + R_SCI_B_CCR0_BY_LH_OFFSET)
#define R_SCI_B0_CCR0_HA_H                 (R_SCI_B0_BASE + R_SCI_B_CCR0_HA_H_OFFSET)
#define R_SCI_B0_CCR0_BY_HL                (R_SCI_B0_BASE + R_SCI_B_CCR0_BY_HL_OFFSET)
#define R_SCI_B0_CCR0_BY_HH                (R_SCI_B0_BASE + R_SCI_B_CCR0_BY_HH_OFFSET)
#define R_SCI_B0_CCR1                      (R_SCI_B0_BASE + R_SCI_B_CCR1_OFFSET)
#define R_SCI_B0_CCR1_HA_L                 (R_SCI_B0_BASE + R_SCI_B_CCR1_HA_L_OFFSET)
#define R_SCI_B0_CCR1_BY_LL                (R_SCI_B0_BASE + R_SCI_B_CCR1_BY_LL_OFFSET)
#define R_SCI_B0_CCR1_BY_LH                (R_SCI_B0_BASE + R_SCI_B_CCR1_BY_LH_OFFSET)
#define R_SCI_B0_CCR1_HA_H                 (R_SCI_B0_BASE + R_SCI_B_CCR1_HA_H_OFFSET)
#define R_SCI_B0_CCR1_BY_HL                (R_SCI_B0_BASE + R_SCI_B_CCR1_BY_HL_OFFSET)
#define R_SCI_B0_CCR1_BY_HH                (R_SCI_B0_BASE + R_SCI_B_CCR1_BY_HH_OFFSET)
#define R_SCI_B0_CCR2                      (R_SCI_B0_BASE + R_SCI_B_CCR2_OFFSET)
#define R_SCI_B0_CCR2_HA_L                 (R_SCI_B0_BASE + R_SCI_B_CCR2_HA_L_OFFSET)
#define R_SCI_B0_CCR2_BY_LL                (R_SCI_B0_BASE + R_SCI_B_CCR2_BY_LL_OFFSET)
#define R_SCI_B0_CCR2_BY_LH                (R_SCI_B0_BASE + R_SCI_B_CCR2_BY_LH_OFFSET)
#define R_SCI_B0_CCR2_HA_H                 (R_SCI_B0_BASE + R_SCI_B_CCR2_HA_H_OFFSET)
#define R_SCI_B0_CCR2_BY_HL                (R_SCI_B0_BASE + R_SCI_B_CCR2_BY_HL_OFFSET)
#define R_SCI_B0_CCR2_BY_HH                (R_SCI_B0_BASE + R_SCI_B_CCR2_BY_HH_OFFSET)
#define R_SCI_B0_CCR3                      (R_SCI_B0_BASE + R_SCI_B_CCR3_OFFSET)
#define R_SCI_B0_CCR3_HA_L                 (R_SCI_B0_BASE + R_SCI_B_CCR3_HA_L_OFFSET)
#define R_SCI_B0_CCR3_BY_LL                (R_SCI_B0_BASE + R_SCI_B_CCR3_BY_LL_OFFSET)
#define R_SCI_B0_CCR3_BY_LH                (R_SCI_B0_BASE + R_SCI_B_CCR3_BY_LH_OFFSET)
#define R_SCI_B0_CCR3_HA_H                 (R_SCI_B0_BASE + R_SCI_B_CCR3_HA_H_OFFSET)
#define R_SCI_B0_CCR3_BY_HL                (R_SCI_B0_BASE + R_SCI_B_CCR3_BY_HL_OFFSET)
#define R_SCI_B0_CCR3_BY_HH                (R_SCI_B0_BASE + R_SCI_B_CCR3_BY_HH_OFFSET)
#define R_SCI_B0_CCR4                      (R_SCI_B0_BASE + R_SCI_B_CCR4_OFFSET)
#define R_SCI_B0_CCR4_HA_L                 (R_SCI_B0_BASE + R_SCI_B_CCR4_HA_L_OFFSET)
#define R_SCI_B0_CCR4_BY_LL                (R_SCI_B0_BASE + R_SCI_B_CCR4_BY_LL_OFFSET)
#define R_SCI_B0_CCR4_BY_LH                (R_SCI_B0_BASE + R_SCI_B_CCR4_BY_LH_OFFSET)
#define R_SCI_B0_CCR4_HA_H                 (R_SCI_B0_BASE + R_SCI_B_CCR4_HA_H_OFFSET)
#define R_SCI_B0_CCR4_BY_HL                (R_SCI_B0_BASE + R_SCI_B_CCR4_BY_HL_OFFSET)
#define R_SCI_B0_CCR4_BY_HH                (R_SCI_B0_BASE + R_SCI_B_CCR4_BY_HH_OFFSET)
#define R_SCI_B0_CESR                      (R_SCI_B0_BASE + R_SCI_B_CESR_OFFSET)
#define R_SCI_B0_HCR                       (R_SCI_B0_BASE + R_SCI_B_HCR_OFFSET)
#define R_SCI_B0_ICR                       (R_SCI_B0_BASE + R_SCI_B_ICR_OFFSET)
#define R_SCI_B0_ICR_HA_L                  (R_SCI_B0_BASE + R_SCI_B_ICR_HA_L_OFFSET)
#define R_SCI_B0_ICR_BY_LL                 (R_SCI_B0_BASE + R_SCI_B_ICR_BY_LL_OFFSET)
#define R_SCI_B0_ICR_BY_LH                 (R_SCI_B0_BASE + R_SCI_B_ICR_BY_LH_OFFSET)
#define R_SCI_B0_ICR_HA_H                  (R_SCI_B0_BASE + R_SCI_B_ICR_HA_H_OFFSET)
#define R_SCI_B0_ICR_BY_HL                 (R_SCI_B0_BASE + R_SCI_B_ICR_BY_HL_OFFSET)
#define R_SCI_B0_FCR                       (R_SCI_B0_BASE + R_SCI_B_FCR_OFFSET)
#define R_SCI_B0_FCR_HA_L                  (R_SCI_B0_BASE + R_SCI_B_FCR_HA_L_OFFSET)
#define R_SCI_B0_FCR_BY_LL                 (R_SCI_B0_BASE + R_SCI_B_FCR_BY_LL_OFFSET)
#define R_SCI_B0_FCR_BY_LH                 (R_SCI_B0_BASE + R_SCI_B_FCR_BY_LH_OFFSET)
#define R_SCI_B0_FCR_HA_H                  (R_SCI_B0_BASE + R_SCI_B_FCR_HA_H_OFFSET)
#define R_SCI_B0_FCR_BY_HL                 (R_SCI_B0_BASE + R_SCI_B_FCR_BY_HL_OFFSET)
#define R_SCI_B0_FCR_BY_HH                 (R_SCI_B0_BASE + R_SCI_B_FCR_BY_HH_OFFSET)
#define R_SCI_B0_MCR                       (R_SCI_B0_BASE + R_SCI_B_MCR_OFFSET)
#define R_SCI_B0_MCR_HA_L                  (R_SCI_B0_BASE + R_SCI_B_MCR_HA_L_OFFSET)
#define R_SCI_B0_MCR_BY_LL                 (R_SCI_B0_BASE + R_SCI_B_MCR_BY_LL_OFFSET)
#define R_SCI_B0_MCR_BY_LH                 (R_SCI_B0_BASE + R_SCI_B_MCR_BY_LH_OFFSET)
#define R_SCI_B0_MCR_HA_H                  (R_SCI_B0_BASE + R_SCI_B_MCR_HA_H_OFFSET)
#define R_SCI_B0_MCR_BY_HL                 (R_SCI_B0_BASE + R_SCI_B_MCR_BY_HL_OFFSET)
#define R_SCI_B0_MCR_BY_HH                 (R_SCI_B0_BASE + R_SCI_B_MCR_BY_HH_OFFSET)
#define R_SCI_B0_DCR                       (R_SCI_B0_BASE + R_SCI_B_DCR_OFFSET)
#define R_SCI_B0_DCR_HA_L                  (R_SCI_B0_BASE + R_SCI_B_DCR_HA_L_OFFSET)
#define R_SCI_B0_DCR_BY_LL                 (R_SCI_B0_BASE + R_SCI_B_DCR_BY_LL_OFFSET)
#define R_SCI_B0_DCR_BY_LH                 (R_SCI_B0_BASE + R_SCI_B_DCR_BY_LH_OFFSET)
#define R_SCI_B0_DCR_HA_H                  (R_SCI_B0_BASE + R_SCI_B_DCR_HA_H_OFFSET)
#define R_SCI_B0_DCR_BY_HL                 (R_SCI_B0_BASE + R_SCI_B_DCR_BY_HL_OFFSET)
#define R_SCI_B0_XCR0                      (R_SCI_B0_BASE + R_SCI_B_XCR0_OFFSET)
#define R_SCI_B0_XCR0_HA_L                 (R_SCI_B0_BASE + R_SCI_B_XCR0_HA_L_OFFSET)
#define R_SCI_B0_XCR0_BY_LL                (R_SCI_B0_BASE + R_SCI_B_XCR0_BY_LL_OFFSET)
#define R_SCI_B0_XCR0_BY_LH                (R_SCI_B0_BASE + R_SCI_B_XCR0_BY_LH_OFFSET)
#define R_SCI_B0_XCR0_HA_H                 (R_SCI_B0_BASE + R_SCI_B_XCR0_HA_H_OFFSET)
#define R_SCI_B0_XCR0_BY_HL                (R_SCI_B0_BASE + R_SCI_B_XCR0_BY_HL_OFFSET)
#define R_SCI_B0_XCR0_BY_HH                (R_SCI_B0_BASE + R_SCI_B_XCR0_BY_HH_OFFSET)
#define R_SCI_B0_XCR1                      (R_SCI_B0_BASE + R_SCI_B_XCR1_OFFSET)
#define R_SCI_B0_XCR1_HA_L                 (R_SCI_B0_BASE + R_SCI_B_XCR1_HA_L_OFFSET)
#define R_SCI_B0_XCR1_BY_LL                (R_SCI_B0_BASE + R_SCI_B_XCR1_BY_LL_OFFSET)
#define R_SCI_B0_XCR1_BY_LH                (R_SCI_B0_BASE + R_SCI_B_XCR1_BY_LH_OFFSET)
#define R_SCI_B0_XCR1_HA_H                 (R_SCI_B0_BASE + R_SCI_B_XCR1_HA_H_OFFSET)
#define R_SCI_B0_XCR1_BY_HL                (R_SCI_B0_BASE + R_SCI_B_XCR1_BY_HL_OFFSET)
#define R_SCI_B0_XCR1_BY_HH                (R_SCI_B0_BASE + R_SCI_B_XCR1_BY_HH_OFFSET)
#define R_SCI_B0_XCR2                      (R_SCI_B0_BASE + R_SCI_B_XCR2_OFFSET)
#define R_SCI_B0_XCR2_HA_L                 (R_SCI_B0_BASE + R_SCI_B_XCR2_HA_L_OFFSET)
#define R_SCI_B0_XCR2_BY_LL                (R_SCI_B0_BASE + R_SCI_B_XCR2_BY_LL_OFFSET)
#define R_SCI_B0_XCR2_BY_LH                (R_SCI_B0_BASE + R_SCI_B_XCR2_BY_LH_OFFSET)
#define R_SCI_B0_XCR2_HA_H                 (R_SCI_B0_BASE + R_SCI_B_XCR2_HA_H_OFFSET)
#define R_SCI_B0_XCR2_BY_HL                (R_SCI_B0_BASE + R_SCI_B_XCR2_BY_HL_OFFSET)
#define R_SCI_B0_XCR2_BY_HH                (R_SCI_B0_BASE + R_SCI_B_XCR2_BY_HH_OFFSET)
#define R_SCI_B0_CSR                       (R_SCI_B0_BASE + R_SCI_B_CSR_OFFSET)
#define R_SCI_B0_ISR                       (R_SCI_B0_BASE + R_SCI_B_ISR_OFFSET)
#define R_SCI_B0_FRSR                      (R_SCI_B0_BASE + R_SCI_B_FRSR_OFFSET)
#define R_SCI_B0_FTSR                      (R_SCI_B0_BASE + R_SCI_B_FTSR_OFFSET)
#define R_SCI_B0_MSR                       (R_SCI_B0_BASE + R_SCI_B_MSR_OFFSET)
#define R_SCI_B0_XSR0                      (R_SCI_B0_BASE + R_SCI_B_XSR0_OFFSET)
#define R_SCI_B0_XSR1                      (R_SCI_B0_BASE + R_SCI_B_XSR1_OFFSET)
#define R_SCI_B0_CFCLR                     (R_SCI_B0_BASE + R_SCI_B_CFCLR_OFFSET)
#define R_SCI_B0_CFCLR_HA_L                (R_SCI_B0_BASE + R_SCI_B_CFCLR_HA_L_OFFSET)
#define R_SCI_B0_CFCLR_BY_LL               (R_SCI_B0_BASE + R_SCI_B_CFCLR_BY_LL_OFFSET)
#define R_SCI_B0_CFCLR_HA_H                (R_SCI_B0_BASE + R_SCI_B_CFCLR_HA_H_OFFSET)
#define R_SCI_B0_CFCLR_BY_HL               (R_SCI_B0_BASE + R_SCI_B_CFCLR_BY_HL_OFFSET)
#define R_SCI_B0_CFCLR_BY_HH               (R_SCI_B0_BASE + R_SCI_B_CFCLR_BY_HH_OFFSET)
#define R_SCI_B0_ICFCLR                    (R_SCI_B0_BASE + R_SCI_B_ICFCLR_OFFSET)
#define R_SCI_B0_ICFCLR_HA_L               (R_SCI_B0_BASE + R_SCI_B_ICFCLR_HA_L_OFFSET)
#define R_SCI_B0_ICFCLR_BY_LL              (R_SCI_B0_BASE + R_SCI_B_ICFCLR_BY_LL_OFFSET)
#define R_SCI_B0_FFCLR                     (R_SCI_B0_BASE + R_SCI_B_FFCLR_OFFSET)
#define R_SCI_B0_FFCLR_HA_L                (R_SCI_B0_BASE + R_SCI_B_FFCLR_HA_L_OFFSET)
#define R_SCI_B0_FFCLR_BY_LL               (R_SCI_B0_BASE + R_SCI_B_FFCLR_BY_LL_OFFSET)
#define R_SCI_B0_MFCLR                     (R_SCI_B0_BASE + R_SCI_B_MFCLR_OFFSET)
#define R_SCI_B0_MFCLR_HA_L                (R_SCI_B0_BASE + R_SCI_B_MFCLR_HA_L_OFFSET)
#define R_SCI_B0_MFCLR_BY_LL               (R_SCI_B0_BASE + R_SCI_B_MFCLR_BY_LL_OFFSET)
#define R_SCI_B0_XFCLR                     (R_SCI_B0_BASE + R_SCI_B_XFCLR_OFFSET)
#define R_SCI_B0_XFCLR_HA_L                (R_SCI_B0_BASE + R_SCI_B_XFCLR_HA_L_OFFSET)
#define R_SCI_B0_XFCLR_BY_LH               (R_SCI_B0_BASE + R_SCI_B_XFCLR_BY_LH_OFFSET)

/* SCI_B1 Registers */

