apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* SCI_B2 Registers */

#define R_SCI_B2_RDR                       (R_SCI_B2_BASE + R_SCI_B_RDR_OFFSET)
#define R_SCI_B2_TDR                       (R_SCI_B2_BASE + R_SCI_B_TDR_OFFSET)
#define R_SCI_B2_TDR_HA_L                  (R_SCI_B2_BASE + R_SCI_B_TDR_HA_L_OFFSET)
#define R_SCI_B2_TDR_BY_LL                 (R_SCI_B2_BASE + R_SCI_B_TDR_BY_LL_OFFSET)
#define R_SCI_B2_TDR_BY_LH                 (R_SCI_B2_BASE + R_SCI_B_TDR_BY_LH_OFFSET)
#define R_SCI_B2_CCR0                      (R_SCI_B2_BASE + R_SCI_B_CCR0_OFFSET)
#define R_SCI_B2_CCR0_HA_L                 (R_SCI_B2_BASE + R_SCI_B_CCR0_HA_L_OFFSET)
#define R_SCI_B2_CCR0_BY_LL                (R_SCI_B2_BASE + R_SCI_B_CCR0_BY_LL_OFFSET)
#define R_SCI_B2_CCR0_BY_LH                (R_SCI_B2_BASE + R_SCI_B_CCR0_BY_LH_OFFSET)
#define R_SCI_B2_CCR0_HA_H                 (R_SCI_B2_BASE + R_SCI_B_CCR0_HA_H_OFFSET)
#define R_SCI_B2_CCR0_BY_HL                (R_SCI_B2_BASE + R_SCI_B_CCR0_BY_HL_OFFSET)
#define R_SCI_B2_CCR0_BY_HH                (R_SCI_B2_BASE + R_SCI_B_CCR0_BY_HH_OFFSET)
#define R_SCI_B2_CCR1                      (R_SCI_B2_BASE + R_SCI_B_CCR1_OFFSET)
#define R_SCI_B2_CCR1_HA_L                 (R_SCI_B2_BASE + R_SCI_B_CCR1_HA_L_OFFSET)
#define R_SCI_B2_CCR1_BY_LL                (R_SCI_B2_BASE + R_SCI_B_CCR1_BY_LL_OFFSET)
#define R_SCI_B2_CCR1_BY_LH                (R_SCI_B2_BASE + R_SCI_B_CCR1_BY_LH_OFFSET)
#define R_SCI_B2_CCR1_HA_H                 (R_SCI_B2_BASE + R_SCI_B_CCR1_HA_H_OFFSET)
#define R_SCI_B2_CCR1_BY_HL                (R_SCI_B2_BASE + R_SCI_B_CCR1_BY_HL_OFFSET)
#define R_SCI_B2_CCR1_BY_HH                (R_SCI_B2_BASE + R_SCI_B_CCR1_BY_HH_OFFSET)
#define R_SCI_B2_CCR2                      (R_SCI_B2_BASE + R_SCI_B_CCR2_OFFSET)
#define R_SCI_B2_CCR2_HA_L                 (R_SCI_B2_BASE + R_SCI_B_CCR2_HA_L_OFFSET)
#define R_SCI_B2_CCR2_BY_LL                (R_SCI_B2_BASE + R_SCI_B_CCR2_BY_LL_OFFSET)
#define R_SCI_B2_CCR2_BY_LH                (R_SCI_B2_BASE + R_SCI_B_CCR2_BY_LH_OFFSET)
#define R_SCI_B2_CCR2_HA_H                 (R_SCI_B2_BASE + R_SCI_B_CCR2_HA_H_OFFSET)
#define R_SCI_B2_CCR2_BY_HL                (R_SCI_B2_BASE + R_SCI_B_CCR2_BY_HL_OFFSET)
#define R_SCI_B2_CCR2_BY_HH                (R_SCI_B2_BASE + R_SCI_B_CCR2_BY_HH_OFFSET)
#define R_SCI_B2_CCR3                      (R_SCI_B2_BASE + R_SCI_B_CCR3_OFFSET)
#define R_SCI_B2_CCR3_HA_L                 (R_SCI_B2_BASE + R_SCI_B_CCR3_HA_L_OFFSET)
#define R_SCI_B2_CCR3_BY_LL                (R_SCI_B2_BASE + R_SCI_B_CCR3_BY_LL_OFFSET)
#define R_SCI_B2_CCR3_BY_LH                (R_SCI_B2_BASE + R_SCI_B_CCR3_BY_LH_OFFSET)
#define R_SCI_B2_CCR3_HA_H                 (R_SCI_B2_BASE + R_SCI_B_CCR3_HA_H_OFFSET)
#define R_SCI_B2_CCR3_BY_HL                (R_SCI_B2_BASE + R_SCI_B_CCR3_BY_HL_OFFSET)
#define R_SCI_B2_CCR3_BY_HH                (R_SCI_B2_BASE + R_SCI_B_CCR3_BY_HH_OFFSET)
#define R_SCI_B2_CCR4                      (R_SCI_B2_BASE + R_SCI_B_CCR4_OFFSET)
#define R_SCI_B2_CCR4_HA_L                 (R_SCI_B2_BASE + R_SCI_B_CCR4_HA_L_OFFSET)
#define R_SCI_B2_CCR4_BY_LL                (R_SCI_B2_BASE + R_SCI_B_CCR4_BY_LL_OFFSET)
#define R_SCI_B2_CCR4_BY_LH                (R_SCI_B2_BASE + R_SCI_B_CCR4_BY_LH_OFFSET)
#define R_SCI_B2_CCR4_HA_H                 (R_SCI_B2_BASE + R_SCI_B_CCR4_HA_H_OFFSET)
#define R_SCI_B2_CCR4_BY_HL                (R_SCI_B2_BASE + R_SCI_B_CCR4_BY_HL_OFFSET)
#define R_SCI_B2_CCR4_BY_HH                (R_SCI_B2_BASE + R_SCI_B_CCR4_BY_HH_OFFSET)
#define R_SCI_B2_CESR                      (R_SCI_B2_BASE + R_SCI_B_CESR_OFFSET)
#define R_SCI_B2_HCR                       (R_SCI_B2_BASE + R_SCI_B_HCR_OFFSET)
#define R_SCI_B2_ICR                       (R_SCI_B2_BASE + R_SCI_B_ICR_OFFSET)
#define R_SCI_B2_ICR_HA_L                  (R_SCI_B2_BASE + R_SCI_B_ICR_HA_L_OFFSET)
#define R_SCI_B2_ICR_BY_LL                 (R_SCI_B2_BASE + R_SCI_B_ICR_BY_LL_OFFSET)
#define R_SCI_B2_ICR_BY_LH                 (R_SCI_B2_BASE + R_SCI_B_ICR_BY_LH_OFFSET)
#define R_SCI_B2_ICR_HA_H                  (R_SCI_B2_BASE + R_SCI_B_ICR_HA_H_OFFSET)
#define R_SCI_B2_ICR_BY_HL                 (R_SCI_B2_BASE + R_SCI_B_ICR_BY_HL_OFFSET)
#define R_SCI_B2_FCR                       (R_SCI_B2_BASE + R_SCI_B_FCR_OFFSET)
#define R_SCI_B2_FCR_HA_L                  (R_SCI_B2_BASE + R_SCI_B_FCR_HA_L_OFFSET)
#define R_SCI_B2_FCR_BY_LL                 (R_SCI_B2_BASE + R_SCI_B_FCR_BY_LL_OFFSET)
#define R_SCI_B2_FCR_BY_LH                 (R_SCI_B2_BASE + R_SCI_B_FCR_BY_LH_OFFSET)
#define R_SCI_B2_FCR_HA_H                  (R_SCI_B2_BASE + R_SCI_B_FCR_HA_H_OFFSET)
#define R_SCI_B2_FCR_BY_HL                 (R_SCI_B2_BASE + R_SCI_B_FCR_BY_HL_OFFSET)
#define R_SCI_B2_FCR_BY_HH                 (R_SCI_B2_BASE + R_SCI_B_FCR_BY_HH_OFFSET)
#define R_SCI_B2_MCR                       (R_SCI_B2_BASE + R_SCI_B_MCR_OFFSET)
#define R_SCI_B2_MCR_HA_L                  (R_SCI_B2_BASE + R_SCI_B_MCR_HA_L_OFFSET)
#define R_SCI_B2_MCR_BY_LL                 (R_SCI_B2_BASE + R_SCI_B_MCR_BY_LL_OFFSET)
#define R_SCI_B2_MCR_BY_LH                 (R_SCI_B2_BASE + R_SCI_B_MCR_BY_LH_OFFSET)
#define R_SCI_B2_MCR_HA_H                  (R_SCI_B2_BASE + R_SCI_B_MCR_HA_H_OFFSET)
#define R_SCI_B2_MCR_BY_HL                 (R_SCI_B2_BASE + R_SCI_B_MCR_BY_HL_OFFSET)
#define R_SCI_B2_MCR_BY_HH                 (R_SCI_B2_BASE + R_SCI_B_MCR_BY_HH_OFFSET)
#define R_SCI_B2_DCR                       (R_SCI_B2_BASE + R_SCI_B_DCR_OFFSET)
#define R_SCI_B2_DCR_HA_L                  (R_SCI_B2_BASE + R_SCI_B_DCR_HA_L_OFFSET)
#define R_SCI_B2_DCR_BY_LL                 (R_SCI_B2_BASE + R_SCI_B_DCR_BY_LL_OFFSET)
#define R_SCI_B2_DCR_BY_LH                 (R_SCI_B2_BASE + R_SCI_B_DCR_BY_LH_OFFSET)
#define R_SCI_B2_DCR_HA_H                  (R_SCI_B2_BASE + R_SCI_B_DCR_HA_H_OFFSET)
#define R_SCI_B2_DCR_BY_HL                 (R_SCI_B2_BASE + R_SCI_B_DCR_BY_HL_OFFSET)
#define R_SCI_B2_XCR0                      (R_SCI_B2_BASE + R_SCI_B_XCR0_OFFSET)
#define R_SCI_B2_XCR0_HA_L                 (R_SCI_B2_BASE + R_SCI_B_XCR0_HA_L_OFFSET)
#define R_SCI_B2_XCR0_BY_LL                (R_SCI_B2_BASE + R_SCI_B_XCR0_BY_LL_OFFSET)
#define R_SCI_B2_XCR0_BY_LH                (R_SCI_B2_BASE + R_SCI_B_XCR0_BY_LH_OFFSET)
#define R_SCI_B2_XCR0_HA_H                 (R_SCI_B2_BASE + R_SCI_B_XCR0_HA_H_OFFSET)
#define R_SCI_B2_XCR0_BY_HL                (R_SCI_B2_BASE + R_SCI_B_XCR0_BY_HL_OFFSET)
#define R_SCI_B2_XCR0_BY_HH                (R_SCI_B2_BASE + R_SCI_B_XCR0_BY_HH_OFFSET)
#define R_SCI_B2_XCR1                      (R_SCI_B2_BASE + R_SCI_B_XCR1_OFFSET)
#define R_SCI_B2_XCR1_HA_L                 (R_SCI_B2_BASE + R_SCI_B_XCR1_HA_L_OFFSET)
#define R_SCI_B2_XCR1_BY_LL                (R_SCI_B2_BASE + R_SCI_B_XCR1_BY_LL_OFFSET)
#define R_SCI_B2_XCR1_BY_LH                (R_SCI_B2_BASE + R_SCI_B_XCR1_BY_LH_OFFSET)
#define R_SCI_B2_XCR1_HA_H                 (R_SCI_B2_BASE + R_SCI_B_XCR1_HA_H_OFFSET)
#define R_SCI_B2_XCR1_BY_HL                (R_SCI_B2_BASE + R_SCI_B_XCR1_BY_HL_OFFSET)
#define R_SCI_B2_XCR1_BY_HH                (R_SCI_B2_BASE + R_SCI_B_XCR1_BY_HH_OFFSET)
#define R_SCI_B2_XCR2                      (R_SCI_B2_BASE + R_SCI_B_XCR2_OFFSET)
#define R_SCI_B2_XCR2_HA_L                 (R_SCI_B2_BASE + R_SCI_B_XCR2_HA_L_OFFSET)
#define R_SCI_B2_XCR2_BY_LL                (R_SCI_B2_BASE + R_SCI_B_XCR2_BY_LL_OFFSET)
#define R_SCI_B2_XCR2_BY_LH                (R_SCI_B2_BASE + R_SCI_B_XCR2_BY_LH_OFFSET)
#define R_SCI_B2_XCR2_HA_H                 (R_SCI_B2_BASE + R_SCI_B_XCR2_HA_H_OFFSET)
#define R_SCI_B2_XCR2_BY_HL                (R_SCI_B2_BASE + R_SCI_B_XCR2_BY_HL_OFFSET)
#define R_SCI_B2_XCR2_BY_HH                (R_SCI_B2_BASE + R_SCI_B_XCR2_BY_HH_OFFSET)
#define R_SCI_B2_CSR                       (R_SCI_B2_BASE + R_SCI_B_CSR_OFFSET)
#define R_SCI_B2_ISR                       (R_SCI_B2_BASE + R_SCI_B_ISR_OFFSET)
#define R_SCI_B2_FRSR                      (R_SCI_B2_BASE + R_SCI_B_FRSR_OFFSET)
#define R_SCI_B2_FTSR                      (R_SCI_B2_BASE + R_SCI_B_FTSR_OFFSET)
#define R_SCI_B2_MSR                       (R_SCI_B2_BASE + R_SCI_B_MSR_OFFSET)
#define R_SCI_B2_XSR0                      (R_SCI_B2_BASE + R_SCI_B_XSR0_OFFSET)
#define R_SCI_B2_XSR1                      (R_SCI_B2_BASE + R_SCI_B_XSR1_OFFSET)
#define R_SCI_B2_CFCLR                     (R_SCI_B2_BASE + R_SCI_B_CFCLR_OFFSET)
#define R_SCI_B2_CFCLR_HA_L                (R_SCI_B2_BASE + R_SCI_B_CFCLR_HA_L_OFFSET)
#define R_SCI_B2_CFCLR_BY_LL               (R_SCI_B2_BASE + R_SCI_B_CFCLR_BY_LL_OFFSET)
#define R_SCI_B2_CFCLR_HA_H                (R_SCI_B2_BASE + R_SCI_B_CFCLR_HA_H_OFFSET)
#define R_SCI_B2_CFCLR_BY_HL               (R_SCI_B2_BASE + R_SCI_B_CFCLR_BY_HL_OFFSET)
#define R_SCI_B2_CFCLR_BY_HH               (R_SCI_B2_BASE + R_SCI_B_CFCLR_BY_HH_OFFSET)
#define R_SCI_B2_ICFCLR                    (R_SCI_B2_BASE + R_SCI_B_ICFCLR_OFFSET)
#define R_SCI_B2_ICFCLR_HA_L               (R_SCI_B2_BASE + R_SCI_B_ICFCLR_HA_L_OFFSET)
#define R_SCI_B2_ICFCLR_BY_LL              (R_SCI_B2_BASE + R_SCI_B_ICFCLR_BY_LL_OFFSET)
#define R_SCI_B2_FFCLR                     (R_SCI_B2_BASE + R_SCI_B_FFCLR_OFFSET)
#define R_SCI_B2_FFCLR_HA_L                (R_SCI_B2_BASE + R_SCI_B_FFCLR_HA_L_OFFSET)
#define R_SCI_B2_FFCLR_BY_LL               (R_SCI_B2_BASE + R_SCI_B_FFCLR_BY_LL_OFFSET)
#define R_SCI_B2_MFCLR                     (R_SCI_B2_BASE + R_SCI_B_MFCLR_OFFSET)
#define R_SCI_B2_MFCLR_HA_L                (R_SCI_B2_BASE + R_SCI_B_MFCLR_HA_L_OFFSET)
#define R_SCI_B2_MFCLR_BY_LL               (R_SCI_B2_BASE + R_SCI_B_MFCLR_BY_LL_OFFSET)
#define R_SCI_B2_XFCLR                     (R_SCI_B2_BASE + R_SCI_B_XFCLR_OFFSET)
#define R_SCI_B2_XFCLR_HA_L                (R_SCI_B2_BASE + R_SCI_B_XFCLR_HA_L_OFFSET)
#define R_SCI_B2_XFCLR_BY_LH               (R_SCI_B2_BASE + R_SCI_B_XFCLR_BY_LH_OFFSET)

/* SCI_B3 Registers */

#define R_SCI_B3_RDR                       (R_SCI_B3_BASE + R_SCI_B_RDR_OFFSET)
#define R_SCI_B3_TDR                       (R_SCI_B3_BASE + R_SCI_B_TDR_OFFSET)
#define R_SCI_B3_TDR_HA_L                  (R_SCI_B3_BASE + R_SCI_B_TDR_HA_L_OFFSET)
#define R_SCI_B3_TDR_BY_LL                 (R_SCI_B3_BASE + R_SCI_B_TDR_BY_LL_OFFSET)
#define R_SCI_B3_TDR_BY_LH                 (R_SCI_B3_BASE + R_SCI_B_TDR_BY_LH_OFFSET)
#define R_SCI_B3_CCR0                      (R_SCI_B3_BASE + R_SCI_B_CCR0_OFFSET)
#define R_SCI_B3_CCR0_HA_L                 (R_SCI_B3_BASE + R_SCI_B_CCR0_HA_L_OFFSET)
#define R_SCI_B3_CCR0_BY_LL                (R_SCI_B3_BASE + R_SCI_B_CCR0_BY_LL_OFFSET)
#define R_SCI_B3_CCR0_BY_LH                (R_SCI_B3_BASE + R_SCI_B_CCR0_BY_LH_OFFSET)
#define R_SCI_B3_CCR0_HA_H                 (R_SCI_B3_BASE + R_SCI_B_CCR0_HA_H_OFFSET)
#define R_SCI_B3_CCR0_BY_HL                (R_SCI_B3_BASE + R_SCI_B_CCR0_BY_HL_OFFSET)
#define R_SCI_B3_CCR0_BY_HH                (R_SCI_B3_BASE + R_SCI_B_CCR0_BY_HH_OFFSET)
#define R_SCI_B3_CCR1                      (R_SCI_B3_BASE + R_SCI_B_CCR1_OFFSET)
#define R_SCI_B3_CCR1_HA_L                 (R_SCI_B3_BASE + R_SCI_B_CCR1_HA_L_OFFSET)
#define R_SCI_B3_CCR1_BY_LL                (R_SCI_B3_BASE + R_SCI_B_CCR1_BY_LL_OFFSET)
#define R_SCI_B3_CCR1_BY_LH                (R_SCI_B3_BASE + R_SCI_B_CCR1_BY_LH_OFFSET)
#define R_SCI_B3_CCR1_HA_H                 (R_SCI_B3_BASE + R_SCI_B_CCR1_HA_H_OFFSET)
#define R_SCI_B3_CCR1_BY_HL                (R_SCI_B3_BASE + R_SCI_B_CCR1_BY_HL_OFFSET)
#define R_SCI_B3_CCR1_BY_HH                (R_SCI_B3_BASE + R_SCI_B_CCR1_BY_HH_OFFSET)
#define R_SCI_B3_CCR2                      (R_SCI_B3_BASE + R_SCI_B_CCR2_OFFSET)
#define R_SCI_B3_CCR2_HA_L                 (R_SCI_B3_BASE + R_SCI_B_CCR2_HA_L_OFFSET)
#define R_SCI_B3_CCR2_BY_LL                (R_SCI_B3_BASE + R_SCI_B_CCR2_BY_LL_OFFSET)
#define R_SCI_B3_CCR2_BY_LH                (R_SCI_B3_BASE + R_SCI_B_CCR2_BY_LH_OFFSET)
#define R_SCI_B3_CCR2_HA_H                 (R_SCI_B3_BASE + R_SCI_B_CCR2_HA_H_OFFSET)
#define R_SCI_B3_CCR2_BY_HL                (R_SCI_B3_BASE + R_SCI_B_CCR2_BY_HL_OFFSET)
#define R_SCI_B3_CCR2_BY_HH                (R_SCI_B3_BASE + R_SCI_B_CCR2_BY_HH_OFFSET)
#define R_SCI_B3_CCR3                      (R_SCI_B3_BASE + R_SCI_B_CCR3_OFFSET)
#define R_SCI_B3_CCR3_HA_L                 (R_SCI_B3_BASE + R_SCI_B_CCR3_HA_L_OFFSET)
#define R_SCI_B3_CCR3_BY_LL                (R_SCI_B3_BASE + R_SCI_B_CCR3_BY_LL_OFFSET)
#define R_SCI_B3_CCR3_BY_LH                (R_SCI_B3_BASE + R_SCI_B_CCR3_BY_LH_OFFSET)
#define R_SCI_B3_CCR3_HA_H                 (R_SCI_B3_BASE + R_SCI_B_CCR3_HA_H_OFFSET)
#define R_SCI_B3_CCR3_BY_HL                (R_SCI_B3_BASE + R_SCI_B_CCR3_BY_HL_OFFSET)
#define R_SCI_B3_CCR3_BY_HH                (R_SCI_B3_BASE + R_SCI_B_CCR3_BY_HH_OFFSET)
#define R_SCI_B3_CCR4                      (R_SCI_B3_BASE + R_SCI_B_CCR4_OFFSET)
#define R_SCI_B3_CCR4_HA_L                 (R_SCI_B3_BASE + R_SCI_B_CCR4_HA_L_OFFSET)
#define R_SCI_B3_CCR4_BY_LL                (R_SCI_B3_BASE + R_SCI_B_CCR4_BY_LL_OFFSET)
#define R_SCI_B3_CCR4_BY_LH                (R_SCI_B3_BASE + R_SCI_B_CCR4_BY_LH_OFFSET)
#define R_SCI_B3_CCR4_HA_H                 (R_SCI_B3_BASE + R_SCI_B_CCR4_HA_H_OFFSET)
#define R_SCI_B3_CCR4_BY_HL                (R_SCI_B3_BASE + R_SCI_B_CCR4_BY_HL_OFFSET)
#define R_SCI_B3_CCR4_BY_HH                (R_SCI_B3_BASE + R_SCI_B_CCR4_BY_HH_OFFSET)
#define R_SCI_B3_CESR                      (R_SCI_B3_BASE + R_SCI_B_CESR_OFFSET)
#define R_SCI_B3_HCR                       (R_SCI_B3_BASE + R_SCI_B_HCR_OFFSET)
#define R_SCI_B3_ICR                       (R_SCI_B3_BASE + R_SCI_B_ICR_OFFSET)
#define R_SCI_B3_ICR_HA_L                  (R_SCI_B3_BASE + R_SCI_B_ICR_HA_L_OFFSET)
#define R_SCI_B3_ICR_BY_LL                 (R_SCI_B3_BASE + R_SCI_B_ICR_BY_LL_OFFSET)
#define R_SCI_B3_ICR_BY_LH                 (R_SCI_B3_BASE + R_SCI_B_ICR_BY_LH_OFFSET)
#define R_SCI_B3_ICR_HA_H                  (R_SCI_B3_BASE + R_SCI_B_ICR_HA_H_OFFSET)
#define R_SCI_B3_ICR_BY_HL                 (R_SCI_B3_BASE + R_SCI_B_ICR_BY_HL_OFFSET)
#define R_SCI_B3_FCR                       (R_SCI_B3_BASE + R_SCI_B_FCR_OFFSET)
#define R_SCI_B3_FCR_HA_L                  (R_SCI_B3_BASE + R_SCI_B_FCR_HA_L_OFFSET)
#define R_SCI_B3_FCR_BY_LL                 (R_SCI_B3_BASE + R_SCI_B_FCR_BY_LL_OFFSET)
#define R_SCI_B3_FCR_BY_LH                 (R_SCI_B3_BASE + R_SCI_B_FCR_BY_LH_OFFSET)
#define R_SCI_B3_FCR_HA_H                  (R_SCI_B3_BASE + R_SCI_B_FCR_HA_H_OFFSET)
#define R_SCI_B3_FCR_BY_HL                 (R_SCI_B3_BASE + R_SCI_B_FCR_BY_HL_OFFSET)
#define R_SCI_B3_FCR_BY_HH                 (R_SCI_B3_BASE + R_SCI_B_FCR_BY_HH_OFFSET)
#define R_SCI_B3_MCR                       (R_SCI_B3_BASE + R_SCI_B_MCR_OFFSET)
#define R_SCI_B3_MCR_HA_L                  (R_SCI_B3_BASE + R_SCI_B_MCR_HA_L_OFFSET)
#define R_SCI_B3_MCR_BY_LL                 (R_SCI_B3_BASE + R_SCI_B_MCR_BY_LL_OFFSET)
#define R_SCI_B3_MCR_BY_LH                 (R_SCI_B3_BASE + R_SCI_B_MCR_BY_LH_OFFSET)
#define R_SCI_B3_MCR_HA_H                  (R_SCI_B3_BASE + R_SCI_B_MCR_HA_H_OFFSET)
#define R_SCI_B3_MCR_BY_HL                 (R_SCI_B3_BASE + R_SCI_B_MCR_BY_HL_OFFSET)
#define R_SCI_B3_MCR_BY_HH                 (R_SCI_B3_BASE + R_SCI_B_MCR_BY_HH_OFFSET)
#define R_SCI_B3_DCR                       (R_SCI_B3_BASE + R_SCI_B_DCR_OFFSET)
#define R_SCI_B3_DCR_HA_L                  (R_SCI_B3_BASE + R_SCI_B_DCR_HA_L_OFFSET)
#define R_SCI_B3_DCR_BY_LL                 (R_SCI_B3_BASE + R_SCI_B_DCR_BY_LL_OFFSET)
#define R_SCI_B3_DCR_BY_LH                 (R_SCI_B3_BASE + R_SCI_B_DCR_BY_LH_OFFSET)
#define R_SCI_B3_DCR_HA_H                  (R_SCI_B3_BASE + R_SCI_B_DCR_HA_H_OFFSET)
#define R_SCI_B3_DCR_BY_HL                 (R_SCI_B3_BASE + R_SCI_B_DCR_BY_HL_OFFSET)
#define R_SCI_B3_XCR0                      (R_SCI_B3_BASE + R_SCI_B_XCR0_OFFSET)
#define R_SCI_B3_XCR0_HA_L                 (R_SCI_B3_BASE + R_SCI_B_XCR0_HA_L_OFFSET)
#define R_SCI_B3_XCR0_BY_LL                (R_SCI_B3_BASE + R_SCI_B_XCR0_BY_LL_OFFSET)
#define R_SCI_B3_XCR0_BY_LH                (R_SCI_B3_BASE + R_SCI_B_XCR0_BY_LH_OFFSET)
#define R_SCI_B3_XCR0_HA_H                 (R_SCI_B3_BASE + R_SCI_B_XCR0_HA_H_OFFSET)
#define R_SCI_B3_XCR0_BY_HL                (R_SCI_B3_BASE + R_SCI_B_XCR0_BY_HL_OFFSET)
#define R_SCI_B3_XCR0_BY_HH                (R_SCI_B3_BASE + R_SCI_B_XCR0_BY_HH_OFFSET)
#define R_SCI_B3_XCR1                      (R_SCI_B3_BASE + R_SCI_B_XCR1_OFFSET)
#define R_SCI_B3_XCR1_HA_L                 (R_SCI_B3_BASE + R_SCI_B_XCR1_HA_L_OFFSET)
#define R_SCI_B3_XCR1_BY_LL                (R_SCI_B3_BASE + R_SCI_B_XCR1_BY_LL_OFFSET)
#define R_SCI_B3_XCR1_BY_LH                (R_SCI_B3_BASE + R_SCI_B_XCR1_BY_LH_OFFSET)
#define R_SCI_B3_XCR1_HA_H                 (R_SCI_B3_BASE + R_SCI_B_XCR1_HA_H_OFFSET)
#define R_SCI_B3_XCR1_BY_HL                (R_SCI_B3_BASE + R_SCI_B_XCR1_BY_HL_OFFSET)
#define R_SCI_B3_XCR1_BY_HH                (R_SCI_B3_BASE + R_SCI_B_XCR1_BY_HH_OFFSET)
#define R_SCI_B3_XCR2                      (R_SCI_B3_BASE + R_SCI_B_XCR2_OFFSET)
#define R_SCI_B3_XCR2_HA_L                 (R_SCI_B3_BASE + R_SCI_B_XCR2_HA_L_OFFSET)
#define R_SCI_B3_XCR2_BY_LL                (R_SCI_B3_BASE + R_SCI_B_XCR2_BY_LL_OFFSET)
#define R_SCI_B3_XCR2_BY_LH                (R_SCI_B3_BASE + R_SCI_B_XCR2_BY_LH_OFFSET)
#define R_SCI_B3_XCR2_HA_H                 (R_SCI_B3_BASE + R_SCI_B_XCR2_HA_H_OFFSET)
#define R_SCI_B3_XCR2_BY_HL                (R_SCI_B3_BASE + R_SCI_B_XCR2_BY_HL_OFFSET)
#define R_SCI_B3_XCR2_BY_HH                (R_SCI_B3_BASE + R_SCI_B_XCR2_BY_HH_OFFSET)
#define R_SCI_B3_CSR                       (R_SCI_B3_BASE + R_SCI_B_CSR_OFFSET)
#define R_SCI_B3_ISR                       (R_SCI_B3_BASE + R_SCI_B_ISR_OFFSET)
#define R_SCI_B3_FRSR                      (R_SCI_B3_BASE + R_SCI_B_FRSR_OFFSET)
#define R_SCI_B3_FTSR                      (R_SCI_B3_BASE + R_SCI_B_FTSR_OFFSET)
#define R_SCI_B3_MSR                       (R_SCI_B3_BASE + R_SCI_B_MSR_OFFSET)
#define R_SCI_B3_XSR0                      (R_SCI_B3_BASE + R_SCI_B_XSR0_OFFSET)
#define R_SCI_B3_XSR1                      (R_SCI_B3_BASE + R_SCI_B_XSR1_OFFSET)
#define R_SCI_B3_CFCLR                     (R_SCI_B3_BASE + R_SCI_B_CFCLR_OFFSET)
#define R_SCI_B3_CFCLR_HA_L                (R_SCI_B3_BASE + R_SCI_B_CFCLR_HA_L_OFFSET)
#define R_SCI_B3_CFCLR_BY_LL               (R_SCI_B3_BASE + R_SCI_B_CFCLR_BY_LL_OFFSET)
#define R_SCI_B3_CFCLR_HA_H                (R_SCI_B3_BASE + R_SCI_B_CFCLR_HA_H_OFFSET)
#define R_SCI_B3_CFCLR_BY_HL               (R_SCI_B3_BASE + R_SCI_B_CFCLR_BY_HL_OFFSET)
#define R_SCI_B3_CFCLR_BY_HH               (R_SCI_B3_BASE + R_SCI_B_CFCLR_BY_HH_OFFSET)
#define R_SCI_B3_ICFCLR                    (R_SCI_B3_BASE + R_SCI_B_ICFCLR_OFFSET)
#define R_SCI_B3_ICFCLR_HA_L               (R_SCI_B3_BASE + R_SCI_B_ICFCLR_HA_L_OFFSET)
#define R_SCI_B3_ICFCLR_BY_LL              (R_SCI_B3_BASE + R_SCI_B_ICFCLR_BY_LL_OFFSET)
#define R_SCI_B3_FFCLR                     (R_SCI_B3_BASE + R_SCI_B_FFCLR_OFFSET)
#define R_SCI_B3_FFCLR_HA_L                (R_SCI_B3_BASE + R_SCI_B_FFCLR_HA_L_OFFSET)
#define R_SCI_B3_FFCLR_BY_LL               (R_SCI_B3_BASE + R_SCI_B_FFCLR_BY_LL_OFFSET)
#define R_SCI_B3_MFCLR                     (R_SCI_B3_BASE + R_SCI_B_MFCLR_OFFSET)
#define R_SCI_B3_MFCLR_HA_L                (R_SCI_B3_BASE + R_SCI_B_MFCLR_HA_L_OFFSET)
#define R_SCI_B3_MFCLR_BY_LL               (R_SCI_B3_BASE + R_SCI_B_MFCLR_BY_LL_OFFSET)
#define R_SCI_B3_XFCLR                     (R_SCI_B3_BASE + R_SCI_B_XFCLR_OFFSET)
#define R_SCI_B3_XFCLR_HA_L                (R_SCI_B3_BASE + R_SCI_B_XFCLR_HA_L_OFFSET)
#define R_SCI_B3_XFCLR_BY_LH               (R_SCI_B3_BASE + R_SCI_B_XFCLR_BY_LH_OFFSET)

/* SCI_B4 Registers */

