apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B4_RDR                       (R_SCI_B4_BASE + R_SCI_B_RDR_OFFSET)
#define R_SCI_B4_TDR                       (R_SCI_B4_BASE + R_SCI_B_TDR_OFFSET)
#define R_SCI_B4_TDR_HA_L                  (R_SCI_B4_BASE + R_SCI_B_TDR_HA_L_OFFSET)
#define R_SCI_B4_TDR_BY_LL                 (R_SCI_B4_BASE + R_SCI_B_TDR_BY_LL_OFFSET)
#define R_SCI_B4_TDR_BY_LH                 (R_SCI_B4_BASE + R_SCI_B_TDR_BY_LH_OFFSET)
#define R_SCI_B4_CCR0                      (R_SCI_B4_BASE + R_SCI_B_CCR0_OFFSET)
#define R_SCI_B4_CCR0_HA_L                 (R_SCI_B4_BASE + R_SCI_B_CCR0_HA_L_OFFSET)
#define R_SCI_B4_CCR0_BY_LL                (R_SCI_B4_BASE + R_SCI_B_CCR0_BY_LL_OFFSET)
#define R_SCI_B4_CCR0_BY_LH                (R_SCI_B4_BASE + R_SCI_B_CCR0_BY_LH_OFFSET)
#define R_SCI_B4_CCR0_HA_H                 (R_SCI_B4_BASE + R_SCI_B_CCR0_HA_H_OFFSET)
#define R_SCI_B4_CCR0_BY_HL                (R_SCI_B4_BASE + R_SCI_B_CCR0_BY_HL_OFFSET)
#define R_SCI_B4_CCR0_BY_HH                (R_SCI_B4_BASE + R_SCI_B_CCR0_BY_HH_OFFSET)
#define R_SCI_B4_CCR1                      (R_SCI_B4_BASE + R_SCI_B_CCR1_OFFSET)
#define R_SCI_B4_CCR1_HA_L                 (R_SCI_B4_BASE + R_SCI_B_CCR1_HA_L_OFFSET)
#define R_SCI_B4_CCR1_BY_LL                (R_SCI_B4_BASE + R_SCI_B_CCR1_BY_LL_OFFSET)
#define R_SCI_B4_CCR1_BY_LH                (R_SCI_B4_BASE + R_SCI_B_CCR1_BY_LH_OFFSET)
#define R_SCI_B4_CCR1_HA_H                 (R_SCI_B4_BASE + R_SCI_B_CCR1_HA_H_OFFSET)
#define R_SCI_B4_CCR1_BY_HL                (R_SCI_B4_BASE + R_SCI_B_CCR1_BY_HL_OFFSET)
#define R_SCI_B4_CCR1_BY_HH                (R_SCI_B4_BASE + R_SCI_B_CCR1_BY_HH_OFFSET)
#define R_SCI_B4_CCR2                      (R_SCI_B4_BASE + R_SCI_B_CCR2_OFFSET)
#define R_SCI_B4_CCR2_HA_L                 (R_SCI_B4_BASE + R_SCI_B_CCR2_HA_L_OFFSET)
#define R_SCI_B4_CCR2_BY_LL                (R_SCI_B4_BASE + R_SCI_B_CCR2_BY_LL_OFFSET)
#define R_SCI_B4_CCR2_BY_LH                (R_SCI_B4_BASE + R_SCI_B_CCR2_BY_LH_OFFSET)
#define R_SCI_B4_CCR2_HA_H                 (R_SCI_B4_BASE + R_SCI_B_CCR2_HA_H_OFFSET)
#define R_SCI_B4_CCR2_BY_HL                (R_SCI_B4_BASE + R_SCI_B_CCR2_BY_HL_OFFSET)
#define R_SCI_B4_CCR2_BY_HH                (R_SCI_B4_BASE + R_SCI_B_CCR2_BY_HH_OFFSET)
#define R_SCI_B4_CCR3                      (R_SCI_B4_BASE + R_SCI_B_CCR3_OFFSET)
#define R_SCI_B4_CCR3_HA_L                 (R_SCI_B4_BASE + R_SCI_B_CCR3_HA_L_OFFSET)
#define R_SCI_B4_CCR3_BY_LL                (R_SCI_B4_BASE + R_SCI_B_CCR3_BY_LL_OFFSET)
#define R_SCI_B4_CCR3_BY_LH                (R_SCI_B4_BASE + R_SCI_B_CCR3_BY_LH_OFFSET)
#define R_SCI_B4_CCR3_HA_H                 (R_SCI_B4_BASE + R_SCI_B_CCR3_HA_H_OFFSET)
#define R_SCI_B4_CCR3_BY_HL                (R_SCI_B4_BASE + R_SCI_B_CCR3_BY_HL_OFFSET)
#define R_SCI_B4_CCR3_BY_HH                (R_SCI_B4_BASE + R_SCI_B_CCR3_BY_HH_OFFSET)
#define R_SCI_B4_CCR4                      (R_SCI_B4_BASE + R_SCI_B_CCR4_OFFSET)
#define R_SCI_B4_CCR4_HA_L                 (R_SCI_B4_BASE + R_SCI_B_CCR4_HA_L_OFFSET)
#define R_SCI_B4_CCR4_BY_LL                (R_SCI_B4_BASE + R_SCI_B_CCR4_BY_LL_OFFSET)
#define R_SCI_B4_CCR4_BY_LH                (R_SCI_B4_BASE + R_SCI_B_CCR4_BY_LH_OFFSET)
#define R_SCI_B4_CCR4_HA_H                 (R_SCI_B4_BASE + R_SCI_B_CCR4_HA_H_OFFSET)
#define R_SCI_B4_CCR4_BY_HL                (R_SCI_B4_BASE + R_SCI_B_CCR4_BY_HL_OFFSET)
#define R_SCI_B4_CCR4_BY_HH                (R_SCI_B4_BASE + R_SCI_B_CCR4_BY_HH_OFFSET)
#define R_SCI_B4_CESR                      (R_SCI_B4_BASE + R_SCI_B_CESR_OFFSET)
#define R_SCI_B4_HCR                       (R_SCI_B4_BASE + R_SCI_B_HCR_OFFSET)
#define R_SCI_B4_ICR                       (R_SCI_B4_BASE + R_SCI_B_ICR_OFFSET)
#define R_SCI_B4_ICR_HA_L                  (R_SCI_B4_BASE + R_SCI_B_ICR_HA_L_OFFSET)
#define R_SCI_B4_ICR_BY_LL                 (R_SCI_B4_BASE + R_SCI_B_ICR_BY_LL_OFFSET)
#define R_SCI_B4_ICR_BY_LH                 (R_SCI_B4_BASE + R_SCI_B_ICR_BY_LH_OFFSET)
#define R_SCI_B4_ICR_HA_H                  (R_SCI_B4_BASE + R_SCI_B_ICR_HA_H_OFFSET)
#define R_SCI_B4_ICR_BY_HL                 (R_SCI_B4_BASE + R_SCI_B_ICR_BY_HL_OFFSET)
#define R_SCI_B4_FCR                       (R_SCI_B4_BASE + R_SCI_B_FCR_OFFSET)
#define R_SCI_B4_FCR_HA_L                  (R_SCI_B4_BASE + R_SCI_B_FCR_HA_L_OFFSET)
#define R_SCI_B4_FCR_BY_LL                 (R_SCI_B4_BASE + R_SCI_B_FCR_BY_LL_OFFSET)
#define R_SCI_B4_FCR_BY_LH                 (R_SCI_B4_BASE + R_SCI_B_FCR_BY_LH_OFFSET)
#define R_SCI_B4_FCR_HA_H                  (R_SCI_B4_BASE + R_SCI_B_FCR_HA_H_OFFSET)
#define R_SCI_B4_FCR_BY_HL                 (R_SCI_B4_BASE + R_SCI_B_FCR_BY_HL_OFFSET)
#define R_SCI_B4_FCR_BY_HH                 (R_SCI_B4_BASE + R_SCI_B_FCR_BY_HH_OFFSET)
#define R_SCI_B4_MCR                       (R_SCI_B4_BASE + R_SCI_B_MCR_OFFSET)
#define R_SCI_B4_MCR_HA_L                  (R_SCI_B4_BASE + R_SCI_B_MCR_HA_L_OFFSET)
#define R_SCI_B4_MCR_BY_LL                 (R_SCI_B4_BASE + R_SCI_B_MCR_BY_LL_OFFSET)
#define R_SCI_B4_MCR_BY_LH                 (R_SCI_B4_BASE + R_SCI_B_MCR_BY_LH_OFFSET)
#define R_SCI_B4_MCR_HA_H                  (R_SCI_B4_BASE + R_SCI_B_MCR_HA_H_OFFSET)
#define R_SCI_B4_MCR_BY_HL                 (R_SCI_B4_BASE + R_SCI_B_MCR_BY_HL_OFFSET)
#define R_SCI_B4_MCR_BY_HH                 (R_SCI_B4_BASE + R_SCI_B_MCR_BY_HH_OFFSET)
#define R_SCI_B4_DCR                       (R_SCI_B4_BASE + R_SCI_B_DCR_OFFSET)
#define R_SCI_B4_DCR_HA_L                  (R_SCI_B4_BASE + R_SCI_B_DCR_HA_L_OFFSET)
#define R_SCI_B4_DCR_BY_LL                 (R_SCI_B4_BASE + R_SCI_B_DCR_BY_LL_OFFSET)
#define R_SCI_B4_DCR_BY_LH                 (R_SCI_B4_BASE + R_SCI_B_DCR_BY_LH_OFFSET)
#define R_SCI_B4_DCR_HA_H                  (R_SCI_B4_BASE + R_SCI_B_DCR_HA_H_OFFSET)
#define R_SCI_B4_DCR_BY_HL                 (R_SCI_B4_BASE + R_SCI_B_DCR_BY_HL_OFFSET)
#define R_SCI_B4_XCR0                      (R_SCI_B4_BASE + R_SCI_B_XCR0_OFFSET)
#define R_SCI_B4_XCR0_HA_L                 (R_SCI_B4_BASE + R_SCI_B_XCR0_HA_L_OFFSET)
#define R_SCI_B4_XCR0_BY_LL                (R_SCI_B4_BASE + R_SCI_B_XCR0_BY_LL_OFFSET)
#define R_SCI_B4_XCR0_BY_LH                (R_SCI_B4_BASE + R_SCI_B_XCR0_BY_LH_OFFSET)
#define R_SCI_B4_XCR0_HA_H                 (R_SCI_B4_BASE + R_SCI_B_XCR0_HA_H_OFFSET)
#define R_SCI_B4_XCR0_BY_HL                (R_SCI_B4_BASE + R_SCI_B_XCR0_BY_HL_OFFSET)
#define R_SCI_B4_XCR0_BY_HH                (R_SCI_B4_BASE + R_SCI_B_XCR0_BY_HH_OFFSET)
#define R_SCI_B4_XCR1                      (R_SCI_B4_BASE + R_SCI_B_XCR1_OFFSET)
#define R_SCI_B4_XCR1_HA_L                 (R_SCI_B4_BASE + R_SCI_B_XCR1_HA_L_OFFSET)
#define R_SCI_B4_XCR1_BY_LL                (R_SCI_B4_BASE + R_SCI_B_XCR1_BY_LL_OFFSET)
#define R_SCI_B4_XCR1_BY_LH                (R_SCI_B4_BASE + R_SCI_B_XCR1_BY_LH_OFFSET)
#define R_SCI_B4_XCR1_HA_H                 (R_SCI_B4_BASE + R_SCI_B_XCR1_HA_H_OFFSET)
#define R_SCI_B4_XCR1_BY_HL                (R_SCI_B4_BASE + R_SCI_B_XCR1_BY_HL_OFFSET)
#define R_SCI_B4_XCR1_BY_HH                (R_SCI_B4_BASE + R_SCI_B_XCR1_BY_HH_OFFSET)
#define R_SCI_B4_XCR2                      (R_SCI_B4_BASE + R_SCI_B_XCR2_OFFSET)
#define R_SCI_B4_XCR2_HA_L                 (R_SCI_B4_BASE + R_SCI_B_XCR2_HA_L_OFFSET)
#define R_SCI_B4_XCR2_BY_LL                (R_SCI_B4_BASE + R_SCI_B_XCR2_BY_LL_OFFSET)
#define R_SCI_B4_XCR2_BY_LH                (R_SCI_B4_BASE + R_SCI_B_XCR2_BY_LH_OFFSET)
#define R_SCI_B4_XCR2_HA_H                 (R_SCI_B4_BASE + R_SCI_B_XCR2_HA_H_OFFSET)
#define R_SCI_B4_XCR2_BY_HL                (R_SCI_B4_BASE + R_SCI_B_XCR2_BY_HL_OFFSET)
#define R_SCI_B4_XCR2_BY_HH                (R_SCI_B4_BASE + R_SCI_B_XCR2_BY_HH_OFFSET)
#define R_SCI_B4_CSR                       (R_SCI_B4_BASE + R_SCI_B_CSR_OFFSET)
#define R_SCI_B4_ISR                       (R_SCI_B4_BASE + R_SCI_B_ISR_OFFSET)
#define R_SCI_B4_FRSR                      (R_SCI_B4_BASE + R_SCI_B_FRSR_OFFSET)
#define R_SCI_B4_FTSR                      (R_SCI_B4_BASE + R_SCI_B_FTSR_OFFSET)
#define R_SCI_B4_MSR                       (R_SCI_B4_BASE + R_SCI_B_MSR_OFFSET)
#define R_SCI_B4_XSR0                      (R_SCI_B4_BASE + R_SCI_B_XSR0_OFFSET)
#define R_SCI_B4_XSR1                      (R_SCI_B4_BASE + R_SCI_B_XSR1_OFFSET)
#define R_SCI_B4_CFCLR                     (R_SCI_B4_BASE + R_SCI_B_CFCLR_OFFSET)
#define R_SCI_B4_CFCLR_HA_L                (R_SCI_B4_BASE + R_SCI_B_CFCLR_HA_L_OFFSET)
#define R_SCI_B4_CFCLR_BY_LL               (R_SCI_B4_BASE + R_SCI_B_CFCLR_BY_LL_OFFSET)
#define R_SCI_B4_CFCLR_HA_H                (R_SCI_B4_BASE + R_SCI_B_CFCLR_HA_H_OFFSET)
#define R_SCI_B4_CFCLR_BY_HL               (R_SCI_B4_BASE + R_SCI_B_CFCLR_BY_HL_OFFSET)
#define R_SCI_B4_CFCLR_BY_HH               (R_SCI_B4_BASE + R_SCI_B_CFCLR_BY_HH_OFFSET)
#define R_SCI_B4_ICFCLR                    (R_SCI_B4_BASE + R_SCI_B_ICFCLR_OFFSET)
#define R_SCI_B4_ICFCLR_HA_L               (R_SCI_B4_BASE + R_SCI_B_ICFCLR_HA_L_OFFSET)
#define R_SCI_B4_ICFCLR_BY_LL              (R_SCI_B4_BASE + R_SCI_B_ICFCLR_BY_LL_OFFSET)
#define R_SCI_B4_FFCLR                     (R_SCI_B4_BASE + R_SCI_B_FFCLR_OFFSET)
#define R_SCI_B4_FFCLR_HA_L                (R_SCI_B4_BASE + R_SCI_B_FFCLR_HA_L_OFFSET)
#define R_SCI_B4_FFCLR_BY_LL               (R_SCI_B4_BASE + R_SCI_B_FFCLR_BY_LL_OFFSET)
#define R_SCI_B4_MFCLR                     (R_SCI_B4_BASE + R_SCI_B_MFCLR_OFFSET)
#define R_SCI_B4_MFCLR_HA_L                (R_SCI_B4_BASE + R_SCI_B_MFCLR_HA_L_OFFSET)
#define R_SCI_B4_MFCLR_BY_LL               (R_SCI_B4_BASE + R_SCI_B_MFCLR_BY_LL_OFFSET)
#define R_SCI_B4_XFCLR                     (R_SCI_B4_BASE + R_SCI_B_XFCLR_OFFSET)
#define R_SCI_B4_XFCLR_HA_L                (R_SCI_B4_BASE + R_SCI_B_XFCLR_HA_L_OFFSET)
#define R_SCI_B4_XFCLR_BY_LH               (R_SCI_B4_BASE + R_SCI_B_XFCLR_BY_LH_OFFSET)

/* SCI_B9 Registers */

#define R_SCI_B9_RDR                       (R_SCI_B9_BASE + R_SCI_B_RDR_OFFSET)
#define R_SCI_B9_TDR                       (R_SCI_B9_BASE + R_SCI_B_TDR_OFFSET)
#define R_SCI_B9_TDR_HA_L                  (R_SCI_B9_BASE + R_SCI_B_TDR_HA_L_OFFSET)
#define R_SCI_B9_TDR_BY_LL                 (R_SCI_B9_BASE + R_SCI_B_TDR_BY_LL_OFFSET)
#define R_SCI_B9_TDR_BY_LH                 (R_SCI_B9_BASE + R_SCI_B_TDR_BY_LH_OFFSET)
#define R_SCI_B9_CCR0                      (R_SCI_B9_BASE + R_SCI_B_CCR0_OFFSET)
#define R_SCI_B9_CCR0_HA_L                 (R_SCI_B9_BASE + R_SCI_B_CCR0_HA_L_OFFSET)
#define R_SCI_B9_CCR0_BY_LL                (R_SCI_B9_BASE + R_SCI_B_CCR0_BY_LL_OFFSET)
#define R_SCI_B9_CCR0_BY_LH                (R_SCI_B9_BASE + R_SCI_B_CCR0_BY_LH_OFFSET)
#define R_SCI_B9_CCR0_HA_H                 (R_SCI_B9_BASE + R_SCI_B_CCR0_HA_H_OFFSET)
#define R_SCI_B9_CCR0_BY_HL                (R_SCI_B9_BASE + R_SCI_B_CCR0_BY_HL_OFFSET)
#define R_SCI_B9_CCR0_BY_HH                (R_SCI_B9_BASE + R_SCI_B_CCR0_BY_HH_OFFSET)
#define R_SCI_B9_CCR1                      (R_SCI_B9_BASE + R_SCI_B_CCR1_OFFSET)
#define R_SCI_B9_CCR1_HA_L                 (R_SCI_B9_BASE + R_SCI_B_CCR1_HA_L_OFFSET)
#define R_SCI_B9_CCR1_BY_LL                (R_SCI_B9_BASE + R_SCI_B_CCR1_BY_LL_OFFSET)
#define R_SCI_B9_CCR1_BY_LH                (R_SCI_B9_BASE + R_SCI_B_CCR1_BY_LH_OFFSET)
#define R_SCI_B9_CCR1_HA_H                 (R_SCI_B9_BASE + R_SCI_B_CCR1_HA_H_OFFSET)
#define R_SCI_B9_CCR1_BY_HL                (R_SCI_B9_BASE + R_SCI_B_CCR1_BY_HL_OFFSET)
#define R_SCI_B9_CCR1_BY_HH                (R_SCI_B9_BASE + R_SCI_B_CCR1_BY_HH_OFFSET)
#define R_SCI_B9_CCR2                      (R_SCI_B9_BASE + R_SCI_B_CCR2_OFFSET)
#define R_SCI_B9_CCR2_HA_L                 (R_SCI_B9_BASE + R_SCI_B_CCR2_HA_L_OFFSET)
#define R_SCI_B9_CCR2_BY_LL                (R_SCI_B9_BASE + R_SCI_B_CCR2_BY_LL_OFFSET)
#define R_SCI_B9_CCR2_BY_LH                (R_SCI_B9_BASE + R_SCI_B_CCR2_BY_LH_OFFSET)
#define R_SCI_B9_CCR2_HA_H                 (R_SCI_B9_BASE + R_SCI_B_CCR2_HA_H_OFFSET)
#define R_SCI_B9_CCR2_BY_HL                (R_SCI_B9_BASE + R_SCI_B_CCR2_BY_HL_OFFSET)
#define R_SCI_B9_CCR2_BY_HH                (R_SCI_B9_BASE + R_SCI_B_CCR2_BY_HH_OFFSET)
#define R_SCI_B9_CCR3                      (R_SCI_B9_BASE + R_SCI_B_CCR3_OFFSET)
#define R_SCI_B9_CCR3_HA_L                 (R_SCI_B9_BASE + R_SCI_B_CCR3_HA_L_OFFSET)
#define R_SCI_B9_CCR3_BY_LL                (R_SCI_B9_BASE + R_SCI_B_CCR3_BY_LL_OFFSET)
#define R_SCI_B9_CCR3_BY_LH                (R_SCI_B9_BASE + R_SCI_B_CCR3_BY_LH_OFFSET)
#define R_SCI_B9_CCR3_HA_H                 (R_SCI_B9_BASE + R_SCI_B_CCR3_HA_H_OFFSET)
#define R_SCI_B9_CCR3_BY_HL                (R_SCI_B9_BASE + R_SCI_B_CCR3_BY_HL_OFFSET)
#define R_SCI_B9_CCR3_BY_HH                (R_SCI_B9_BASE + R_SCI_B_CCR3_BY_HH_OFFSET)
#define R_SCI_B9_CCR4                      (R_SCI_B9_BASE + R_SCI_B_CCR4_OFFSET)
#define R_SCI_B9_CCR4_HA_L                 (R_SCI_B9_BASE + R_SCI_B_CCR4_HA_L_OFFSET)
#define R_SCI_B9_CCR4_BY_LL                (R_SCI_B9_BASE + R_SCI_B_CCR4_BY_LL_OFFSET)
#define R_SCI_B9_CCR4_BY_LH                (R_SCI_B9_BASE + R_SCI_B_CCR4_BY_LH_OFFSET)
#define R_SCI_B9_CCR4_HA_H                 (R_SCI_B9_BASE + R_SCI_B_CCR4_HA_H_OFFSET)
#define R_SCI_B9_CCR4_BY_HL                (R_SCI_B9_BASE + R_SCI_B_CCR4_BY_HL_OFFSET)
#define R_SCI_B9_CCR4_BY_HH                (R_SCI_B9_BASE + R_SCI_B_CCR4_BY_HH_OFFSET)
#define R_SCI_B9_CESR                      (R_SCI_B9_BASE + R_SCI_B_CESR_OFFSET)
#define R_SCI_B9_HCR                       (R_SCI_B9_BASE + R_SCI_B_HCR_OFFSET)
#define R_SCI_B9_ICR                       (R_SCI_B9_BASE + R_SCI_B_ICR_OFFSET)
#define R_SCI_B9_ICR_HA_L                  (R_SCI_B9_BASE + R_SCI_B_ICR_HA_L_OFFSET)
#define R_SCI_B9_ICR_BY_LL                 (R_SCI_B9_BASE + R_SCI_B_ICR_BY_LL_OFFSET)
#define R_SCI_B9_ICR_BY_LH                 (R_SCI_B9_BASE + R_SCI_B_ICR_BY_LH_OFFSET)
#define R_SCI_B9_ICR_HA_H                  (R_SCI_B9_BASE + R_SCI_B_ICR_HA_H_OFFSET)
#define R_SCI_B9_ICR_BY_HL                 (R_SCI_B9_BASE + R_SCI_B_ICR_BY_HL_OFFSET)
#define R_SCI_B9_FCR                       (R_SCI_B9_BASE + R_SCI_B_FCR_OFFSET)
#define R_SCI_B9_FCR_HA_L                  (R_SCI_B9_BASE + R_SCI_B_FCR_HA_L_OFFSET)
#define R_SCI_B9_FCR_BY_LL                 (R_SCI_B9_BASE + R_SCI_B_FCR_BY_LL_OFFSET)
#define R_SCI_B9_FCR_BY_LH                 (R_SCI_B9_BASE + R_SCI_B_FCR_BY_LH_OFFSET)
#define R_SCI_B9_FCR_HA_H                  (R_SCI_B9_BASE + R_SCI_B_FCR_HA_H_OFFSET)
#define R_SCI_B9_FCR_BY_HL                 (R_SCI_B9_BASE + R_SCI_B_FCR_BY_HL_OFFSET)
#define R_SCI_B9_FCR_BY_HH                 (R_SCI_B9_BASE + R_SCI_B_FCR_BY_HH_OFFSET)
#define R_SCI_B9_MCR                       (R_SCI_B9_BASE + R_SCI_B_MCR_OFFSET)
#define R_SCI_B9_MCR_HA_L                  (R_SCI_B9_BASE + R_SCI_B_MCR_HA_L_OFFSET)
#define R_SCI_B9_MCR_BY_LL                 (R_SCI_B9_BASE + R_SCI_B_MCR_BY_LL_OFFSET)
#define R_SCI_B9_MCR_BY_LH                 (R_SCI_B9_BASE + R_SCI_B_MCR_BY_LH_OFFSET)
#define R_SCI_B9_MCR_HA_H                  (R_SCI_B9_BASE + R_SCI_B_MCR_HA_H_OFFSET)
#define R_SCI_B9_MCR_BY_HL                 (R_SCI_B9_BASE + R_SCI_B_MCR_BY_HL_OFFSET)
#define R_SCI_B9_MCR_BY_HH                 (R_SCI_B9_BASE + R_SCI_B_MCR_BY_HH_OFFSET)
#define R_SCI_B9_DCR                       (R_SCI_B9_BASE + R_SCI_B_DCR_OFFSET)
#define R_SCI_B9_DCR_HA_L                  (R_SCI_B9_BASE + R_SCI_B_DCR_HA_L_OFFSET)
#define R_SCI_B9_DCR_BY_LL                 (R_SCI_B9_BASE + R_SCI_B_DCR_BY_LL_OFFSET)
#define R_SCI_B9_DCR_BY_LH                 (R_SCI_B9_BASE + R_SCI_B_DCR_BY_LH_OFFSET)
#define R_SCI_B9_DCR_HA_H                  (R_SCI_B9_BASE + R_SCI_B_DCR_HA_H_OFFSET)
#define R_SCI_B9_DCR_BY_HL                 (R_SCI_B9_BASE + R_SCI_B_DCR_BY_HL_OFFSET)
#define R_SCI_B9_XCR0                      (R_SCI_B9_BASE + R_SCI_B_XCR0_OFFSET)
#define R_SCI_B9_XCR0_HA_L                 (R_SCI_B9_BASE + R_SCI_B_XCR0_HA_L_OFFSET)
#define R_SCI_B9_XCR0_BY_LL                (R_SCI_B9_BASE + R_SCI_B_XCR0_BY_LL_OFFSET)
#define R_SCI_B9_XCR0_BY_LH                (R_SCI_B9_BASE + R_SCI_B_XCR0_BY_LH_OFFSET)
#define R_SCI_B9_XCR0_HA_H                 (R_SCI_B9_BASE + R_SCI_B_XCR0_HA_H_OFFSET)
#define R_SCI_B9_XCR0_BY_HL                (R_SCI_B9_BASE + R_SCI_B_XCR0_BY_HL_OFFSET)
#define R_SCI_B9_XCR0_BY_HH                (R_SCI_B9_BASE + R_SCI_B_XCR0_BY_HH_OFFSET)
#define R_SCI_B9_XCR1                      (R_SCI_B9_BASE + R_SCI_B_XCR1_OFFSET)
#define R_SCI_B9_XCR1_HA_L                 (R_SCI_B9_BASE + R_SCI_B_XCR1_HA_L_OFFSET)
#define R_SCI_B9_XCR1_BY_LL                (R_SCI_B9_BASE + R_SCI_B_XCR1_BY_LL_OFFSET)
#define R_SCI_B9_XCR1_BY_LH                (R_SCI_B9_BASE + R_SCI_B_XCR1_BY_LH_OFFSET)
#define R_SCI_B9_XCR1_HA_H                 (R_SCI_B9_BASE + R_SCI_B_XCR1_HA_H_OFFSET)
#define R_SCI_B9_XCR1_BY_HL                (R_SCI_B9_BASE + R_SCI_B_XCR1_BY_HL_OFFSET)
#define R_SCI_B9_XCR1_BY_HH                (R_SCI_B9_BASE + R_SCI_B_XCR1_BY_HH_OFFSET)
#define R_SCI_B9_XCR2                      (R_SCI_B9_BASE + R_SCI_B_XCR2_OFFSET)
#define R_SCI_B9_XCR2_HA_L                 (R_SCI_B9_BASE + R_SCI_B_XCR2_HA_L_OFFSET)
#define R_SCI_B9_XCR2_BY_LL                (R_SCI_B9_BASE + R_SCI_B_XCR2_BY_LL_OFFSET)
#define R_SCI_B9_XCR2_BY_LH                (R_SCI_B9_BASE + R_SCI_B_XCR2_BY_LH_OFFSET)
#define R_SCI_B9_XCR2_HA_H                 (R_SCI_B9_BASE + R_SCI_B_XCR2_HA_H_OFFSET)
#define R_SCI_B9_XCR2_BY_HL                (R_SCI_B9_BASE + R_SCI_B_XCR2_BY_HL_OFFSET)
#define R_SCI_B9_XCR2_BY_HH                (R_SCI_B9_BASE + R_SCI_B_XCR2_BY_HH_OFFSET)
#define R_SCI_B9_CSR                       (R_SCI_B9_BASE + R_SCI_B_CSR_OFFSET)
#define R_SCI_B9_ISR                       (R_SCI_B9_BASE + R_SCI_B_ISR_OFFSET)
#define R_SCI_B9_FRSR                      (R_SCI_B9_BASE + R_SCI_B_FRSR_OFFSET)
#define R_SCI_B9_FTSR                      (R_SCI_B9_BASE + R_SCI_B_FTSR_OFFSET)
#define R_SCI_B9_MSR                       (R_SCI_B9_BASE + R_SCI_B_MSR_OFFSET)
#define R_SCI_B9_XSR0                      (R_SCI_B9_BASE + R_SCI_B_XSR0_OFFSET)
#define R_SCI_B9_XSR1                      (R_SCI_B9_BASE + R_SCI_B_XSR1_OFFSET)
#define R_SCI_B9_CFCLR                     (R_SCI_B9_BASE + R_SCI_B_CFCLR_OFFSET)
#define R_SCI_B9_CFCLR_HA_L                (R_SCI_B9_BASE + R_SCI_B_CFCLR_HA_L_OFFSET)
#define R_SCI_B9_CFCLR_BY_LL               (R_SCI_B9_BASE + R_SCI_B_CFCLR_BY_LL_OFFSET)
#define R_SCI_B9_CFCLR_HA_H                (R_SCI_B9_BASE + R_SCI_B_CFCLR_HA_H_OFFSET)
#define R_SCI_B9_CFCLR_BY_HL               (R_SCI_B9_BASE + R_SCI_B_CFCLR_BY_HL_OFFSET)
#define R_SCI_B9_CFCLR_BY_HH               (R_SCI_B9_BASE + R_SCI_B_CFCLR_BY_HH_OFFSET)
#define R_SCI_B9_ICFCLR                    (R_SCI_B9_BASE + R_SCI_B_ICFCLR_OFFSET)
#define R_SCI_B9_ICFCLR_HA_L               (R_SCI_B9_BASE + R_SCI_B_ICFCLR_HA_L_OFFSET)
#define R_SCI_B9_ICFCLR_BY_LL              (R_SCI_B9_BASE + R_SCI_B_ICFCLR_BY_LL_OFFSET)
#define R_SCI_B9_FFCLR                     (R_SCI_B9_BASE + R_SCI_B_FFCLR_OFFSET)
#define R_SCI_B9_FFCLR_HA_L                (R_SCI_B9_BASE + R_SCI_B_FFCLR_HA_L_OFFSET)
#define R_SCI_B9_FFCLR_BY_LL               (R_SCI_B9_BASE + R_SCI_B_FFCLR_BY_LL_OFFSET)
#define R_SCI_B9_MFCLR                     (R_SCI_B9_BASE + R_SCI_B_MFCLR_OFFSET)
#define R_SCI_B9_MFCLR_HA_L                (R_SCI_B9_BASE + R_SCI_B_MFCLR_HA_L_OFFSET)
#define R_SCI_B9_MFCLR_BY_LL               (R_SCI_B9_BASE + R_SCI_B_MFCLR_BY_LL_OFFSET)
#define R_SCI_B9_XFCLR                     (R_SCI_B9_BASE + R_SCI_B_XFCLR_OFFSET)
#define R_SCI_B9_XFCLR_HA_L                (R_SCI_B9_BASE + R_SCI_B_XFCLR_HA_L_OFFSET)
#define R_SCI_B9_XFCLR_BY_LH               (R_SCI_B9_BASE + R_SCI_B_XFCLR_BY_LH_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Received Data Register (32-bits) *****************************************/

#define R_SCI_B_RDR_RDAT_SHIFT (0)
#define R_SCI_B_RDR_RDAT_MASK (0x1ff)
#define R_SCI_B_RDR_MPB (1 <<  9)   /* 200: Multiprocessor bit flag */
#define R_SCI_B_RDR_DR (1 << 10)    /* 400: Receive data ready flag */
#define R_SCI_B_RDR_FPER (1 << 11)  /* 800: Parity error flag */
#define R_SCI_B_RDR_FFER (1 << 12)  /* 1000: Framing error flag */
#define R_SCI_B_RDR_ORER (1 << 24)  /* 1000000: Overrun error flag */
#define R_SCI_B_RDR_PER (1 << 27)   /* 8000000: Parity Error Flag */
#define R_SCI_B_RDR_FER (1 << 28)   /* 10000000: Framing Error Flag */

/* Transmission Data Register (32-bits) *************************************/

#define R_SCI_B_TDR_TDAT_SHIFT (0)
#define R_SCI_B_TDR_TDAT_MASK (0x1ff)
#define R_SCI_B_TDR_MPBT (1 <<  9)   /* 200: Multi-processor transfer bit flag */
#define R_SCI_B_TDR_TSYNC (1 << 12)  /* 1000: Transmit sync data bit. */

/* Transmission Data Register (16-bits) *************************************/

