apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_TDR_HA_L_TDAT_SHIFT (0)
#define R_SCI_B_TDR_HA_L_TDAT_MASK (0x1ff)
#define R_SCI_B_TDR_HA_L_MPBT (1 <<  9)   /* 200: Multi-processor transfer bit flag */
#define R_SCI_B_TDR_HA_L_TSYNC (1 << 12)  /* 1000: Transmit sync data bit. */

/* Transmission Data Register (8-bits) **************************************/

#define R_SCI_B_TDR_BY_LL_TDAT_SHIFT (0)
#define R_SCI_B_TDR_BY_LL_TDAT_MASK (0xff)

/* Transmission Data Register (8-bits) **************************************/

#define R_SCI_B_TDR_BY_LH_TDAT (1 <<  0)   /* 01: Transmission data. */
#define R_SCI_B_TDR_BY_LH_MPBT (1 <<  1)   /* 02: Multi-processor transfer bit flag */
#define R_SCI_B_TDR_BY_LH_TSYNC (1 <<  4)  /* 10: Transmit sync data bit. */

/* Common Control Register 0 (32-bits) **************************************/

#define R_SCI_B_CCR0_RE (1 <<  0)     /* 01: Receive Enable */
#define R_SCI_B_CCR0_TE (1 <<  4)     /* 10: Transmit Enable */
#define R_SCI_B_CCR0_MPIE (1 <<  8)   /* 100: Multi-Processor Interrupt Enable */
#define R_SCI_B_CCR0_DCME (1 <<  9)   /* 200: Data Compare Match Enable */
#define R_SCI_B_CCR0_IDSEL (1 << 10)  /* 400: ID frame select Bit */
#define R_SCI_B_CCR0_RIE (1 << 16)    /* 10000: Receive Interrupt Enable */
#define R_SCI_B_CCR0_TIE (1 << 20)    /* 100000: Transmit Interrupt Enable */
#define R_SCI_B_CCR0_TEIE (1 << 21)   /* 200000: Transmit End Interrupt Enable */
#define R_SCI_B_CCR0_SSE (1 << 24)    /* 1000000: SSn# Pin Function Enable */

/* Common Control Register 0 (16-bits) **************************************/

#define R_SCI_B_CCR0_HA_L_RE (1 <<  0)     /* 01: Receive Enable */
#define R_SCI_B_CCR0_HA_L_TE (1 <<  4)     /* 10: Transmit Enable */
#define R_SCI_B_CCR0_HA_L_MPIE (1 <<  8)   /* 100: Multi-Processor Interrupt Enable */
#define R_SCI_B_CCR0_HA_L_DCME (1 <<  9)   /* 200: Data Compare Match Enable */
#define R_SCI_B_CCR0_HA_L_IDSEL (1 << 10)  /* 400: ID frame select Bit */

/* Common Control Register 0 (8-bits) ***************************************/

#define R_SCI_B_CCR0_BY_LL_RE (1 <<  0)  /* 01: Receive Enable */
#define R_SCI_B_CCR0_BY_LL_TE (1 <<  4)  /* 10: Transmit Enable */

/* Common Control Register 0 (8-bits) ***************************************/

#define R_SCI_B_CCR0_BY_LH_MPIE (1 <<  0)   /* 01: Multi-Processor Interrupt Enable */
#define R_SCI_B_CCR0_BY_LH_DCME (1 <<  1)   /* 02: Data Compare Match Enable */
#define R_SCI_B_CCR0_BY_LH_IDSEL (1 <<  2)  /* 04: ID frame select Bit */

/* Common Control Register 0 (16-bits) **************************************/

#define R_SCI_B_CCR0_HA_H_RIE (1 <<  0)   /* 01: Receive Interrupt Enable */
#define R_SCI_B_CCR0_HA_H_TIE (1 <<  4)   /* 10: Transmit Interrupt Enable */
#define R_SCI_B_CCR0_HA_H_TEIE (1 <<  5)  /* 20: Transmit End Interrupt Enable */
#define R_SCI_B_CCR0_HA_H_SSE (1 <<  8)   /* 100: SSn# Pin Function Enable */

/* Common Control Register 0 (8-bits) ***************************************/

#define R_SCI_B_CCR0_BY_HL_RIE (1 <<  0)   /* 01: Receive Interrupt Enable */
#define R_SCI_B_CCR0_BY_HL_TIE (1 <<  4)   /* 10: Transmit Interrupt Enable */
#define R_SCI_B_CCR0_BY_HL_TEIE (1 <<  5)  /* 20: Transmit End Interrupt Enable */

/* Common Control Register 0 (8-bits) ***************************************/

#define R_SCI_B_CCR0_BY_HH_SSE (1 <<  0)  /* 01: SSn# Pin Function Enable */

/* Common Control Register 1 (32-bits) **************************************/

#define R_SCI_B_CCR1_CTSE (1 <<  0)                              /* 01: CTS Enable */
#define R_SCI_B_CCR1_CTSPEN (1 <<  1)                            /* 02: CTS external terminal enable bit. */
#define R_SCI_B_CCR1_SPB2DT (1 <<  4)                            /* 10: Serial port break data select bit */
#define R_SCI_B_CCR1_SPB2IO (1 <<  5)                            /* 20: Serial port break I/O bit */
#define R_SCI_B_CCR1_PE (1 <<  8)                                /* 100: Parity Enable */
#define R_SCI_B_CCR1_PM (1 <<  9)                                /* 200: Parity Mode */
#define R_SCI_B_CCR1_TINV (1 << 12)                              /* 1000: TxD invert bit */
#define R_SCI_B_CCR1_RINV (1 << 13)                              /* 2000: RxD invert bit */
#define R_SCI_B_CCR1_SPLP (1 << 16)                              /* 10000: Serial communication Port LoopBack */
#define R_SCI_B_CCR1_SHARPS (1 << 20)                            /* 100000: TxD/RxD Pin Multiplexing Select */
#define R_SCI_B_CCR1_NFCS_SHIFT (24)
#define R_SCI_B_CCR1_NFCS_MASK (0x7)
#  define R_SCI_B_CCR1_NFCS_V000 (0 << R_SCI_B_CCR1_NFCS_SHIFT)  /* The base clock divided by 1 is used with the noise filter. */
#  define R_SCI_B_CCR1_NFCS_V001 (1 << R_SCI_B_CCR1_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 1 is used */
#  define R_SCI_B_CCR1_NFCS_V010 (2 << R_SCI_B_CCR1_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 2 is used */
#  define R_SCI_B_CCR1_NFCS_V011 (3 << R_SCI_B_CCR1_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 4 is used */
#  define R_SCI_B_CCR1_NFCS_V100 (4 << R_SCI_B_CCR1_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 8 is used */
#define R_SCI_B_CCR1_NFEN (1 << 28)                              /* 10000000: Digital Noise Filter Function Enable */

/* Common Control Register 1 (16-bits) **************************************/

#define R_SCI_B_CCR1_HA_L_CTSE (1 <<  0)    /* 01: CTS Enable */
#define R_SCI_B_CCR1_HA_L_CTSPEN (1 <<  1)  /* 02: CTS external terminal enable bit. */
#define R_SCI_B_CCR1_HA_L_SPB2DT (1 <<  4)  /* 10: Serial port break data select bit */
#define R_SCI_B_CCR1_HA_L_SPB2IO (1 <<  5)  /* 20: Serial port break I/O bit */
#define R_SCI_B_CCR1_HA_L_PE (1 <<  8)      /* 100: Parity Enable */
#define R_SCI_B_CCR1_HA_L_PM (1 <<  9)      /* 200: Parity Mode */
#define R_SCI_B_CCR1_HA_L_TINV (1 << 12)    /* 1000: TxD invert bit */
#define R_SCI_B_CCR1_HA_L_RINV (1 << 13)    /* 2000: RxD invert bit */

/* Common Control Register 1 (8-bits) ***************************************/

#define R_SCI_B_CCR1_BY_LL_CTSE (1 <<  0)    /* 01: CTS Enable */
#define R_SCI_B_CCR1_BY_LL_CTSPEN (1 <<  1)  /* 02: CTS external terminal enable bit. */
#define R_SCI_B_CCR1_BY_LL_SPB2DT (1 <<  4)  /* 10: Serial port break data select bit */
#define R_SCI_B_CCR1_BY_LL_SPB2IO (1 <<  5)  /* 20: Serial port break I/O bit */

