apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* Common Control Register 1 (8-bits) ***************************************/

#define R_SCI_B_CCR1_BY_LH_PE (1 <<  0)    /* 01: Parity Enable */
#define R_SCI_B_CCR1_BY_LH_PM (1 <<  1)    /* 02: Parity Mode */
#define R_SCI_B_CCR1_BY_LH_TINV (1 <<  4)  /* 10: TxD invert bit */
#define R_SCI_B_CCR1_BY_LH_RINV (1 <<  5)  /* 20: RxD invert bit */

/* Common Control Register 1 (16-bits) **************************************/

#define R_SCI_B_CCR1_HA_H_SPLP (1 <<  0)                                   /* 01: Serial communication Port LoopBack */
#define R_SCI_B_CCR1_HA_H_SHARPS (1 <<  4)                                 /* 10: TxD/RxD Pin Multiplexing Select */
#define R_SCI_B_CCR1_HA_H_NFCS_SHIFT (8)
#define R_SCI_B_CCR1_HA_H_NFCS_MASK (0x7)
#  define R_SCI_B_CCR1_HA_H_NFCS_V000 (0 << R_SCI_B_CCR1_HA_H_NFCS_SHIFT)  /* The base clock divided by 1 is used with the noise filter. */
#  define R_SCI_B_CCR1_HA_H_NFCS_V001 (1 << R_SCI_B_CCR1_HA_H_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 1 is used */
#  define R_SCI_B_CCR1_HA_H_NFCS_V010 (2 << R_SCI_B_CCR1_HA_H_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 2 is used */
#  define R_SCI_B_CCR1_HA_H_NFCS_V011 (3 << R_SCI_B_CCR1_HA_H_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 4 is used */
#  define R_SCI_B_CCR1_HA_H_NFCS_V100 (4 << R_SCI_B_CCR1_HA_H_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 8 is used */
#define R_SCI_B_CCR1_HA_H_NFEN (1 << 12)                                   /* 1000: Digital Noise Filter Function Enable */

/* Common Control Register 1 (8-bits) ***************************************/

#define R_SCI_B_CCR1_BY_HL_SPLP (1 <<  0)    /* 01: Serial communication Port LoopBack */
#define R_SCI_B_CCR1_BY_HL_SHARPS (1 <<  4)  /* 10: TxD/RxD Pin Multiplexing Select */

/* Common Control Register 1 (8-bits) ***************************************/

#define R_SCI_B_CCR1_BY_HH_NFCS_SHIFT (0)
#define R_SCI_B_CCR1_BY_HH_NFCS_MASK (0x7)
#  define R_SCI_B_CCR1_BY_HH_NFCS_V000 (0 << R_SCI_B_CCR1_BY_HH_NFCS_SHIFT)  /* The base clock divided by 1 is used with the noise filter. */
#  define R_SCI_B_CCR1_BY_HH_NFCS_V001 (1 << R_SCI_B_CCR1_BY_HH_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 1 is used */
#  define R_SCI_B_CCR1_BY_HH_NFCS_V010 (2 << R_SCI_B_CCR1_BY_HH_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 2 is used */
#  define R_SCI_B_CCR1_BY_HH_NFCS_V011 (3 << R_SCI_B_CCR1_BY_HH_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 4 is used */
#  define R_SCI_B_CCR1_BY_HH_NFCS_V100 (4 << R_SCI_B_CCR1_BY_HH_NFCS_SHIFT)  /* The on-chip baud rate generator clock divided by 8 is used */
#define R_SCI_B_CCR1_BY_HH_NFEN (1 <<  4)                                    /* 10: Digital Noise Filter Function Enable */

/* Common Control Register 2 (32-bits) **************************************/

#define R_SCI_B_CCR2_BCP_SHIFT (0)
#define R_SCI_B_CCR2_BCP_MASK (0x7)
#define R_SCI_B_CCR2_BGDM (1 <<  4)                                     /* 10: Baud Rate Generator Double-Speed Mode Select */
#define R_SCI_B_CCR2_ABCS (1 <<  5)                                     /* 20: Asynchronous Mode Base Clock Select */
#define R_SCI_B_CCR2_ABCSE (1 <<  6)                                    /* 40: Asynchronous Mode Base Clock Select1 */
#define R_SCI_B_CCR2_BRR_SHIFT (8)
#define R_SCI_B_CCR2_BRR_MASK (0xff)
#define R_SCI_B_CCR2_BRME (1 << 16)                                     /* 10000: Bit Modulation Enable */
#define R_SCI_B_CCR2_CKS_SHIFT (20)
#define R_SCI_B_CCR2_CKS_MASK (0x3)
#  define R_SCI_B_CCR2_CKS_TCLK_CLOCK (0 << R_SCI_B_CCR2_CKS_SHIFT)     /* TCLK clock */
#  define R_SCI_B_CCR2_CKS_TCLK_4_CLOCK (1 << R_SCI_B_CCR2_CKS_SHIFT)   /* TCLK/4 clock */
#  define R_SCI_B_CCR2_CKS_TCLK_16_CLOCK (2 << R_SCI_B_CCR2_CKS_SHIFT)  /* TCLK/16 clock */
#  define R_SCI_B_CCR2_CKS_TCLK_64_CLOCK (3 << R_SCI_B_CCR2_CKS_SHIFT)  /* TCLK/64 clock */
#define R_SCI_B_CCR2_MDDR_SHIFT (24)
#define R_SCI_B_CCR2_MDDR_MASK (0xff)

/* Common Control Register 2 (16-bits) **************************************/

#define R_SCI_B_CCR2_HA_L_BCP_SHIFT (0)
#define R_SCI_B_CCR2_HA_L_BCP_MASK (0x7)
#define R_SCI_B_CCR2_HA_L_BGDM (1 <<  4)   /* 10: Baud Rate Generator Double-Speed Mode Select */
#define R_SCI_B_CCR2_HA_L_ABCS (1 <<  5)   /* 20: Asynchronous Mode Base Clock Select */
#define R_SCI_B_CCR2_HA_L_ABCSE (1 <<  6)  /* 40: Asynchronous Mode Base Clock Select1 */
#define R_SCI_B_CCR2_HA_L_BRR_SHIFT (8)
#define R_SCI_B_CCR2_HA_L_BRR_MASK (0xff)

/* Common Control Register 2 (8-bits) ***************************************/

#define R_SCI_B_CCR2_BY_LL_BCP_SHIFT (0)
#define R_SCI_B_CCR2_BY_LL_BCP_MASK (0x7)
#define R_SCI_B_CCR2_BY_LL_BGDM (1 <<  4)   /* 10: Baud Rate Generator Double-Speed Mode Select */
#define R_SCI_B_CCR2_BY_LL_ABCS (1 <<  5)   /* 20: Asynchronous Mode Base Clock Select */
#define R_SCI_B_CCR2_BY_LL_ABCSE (1 <<  6)  /* 40: Asynchronous Mode Base Clock Select1 */

/* Common Control Register 2 (8-bits) ***************************************/

#define R_SCI_B_CCR2_BY_LH_BRR_SHIFT (0)
#define R_SCI_B_CCR2_BY_LH_BRR_MASK (0xff)

/* Common Control Register 2 (16-bits) **************************************/

#define R_SCI_B_CCR2_HA_H_BRME (1 <<  0)                                          /* 01: Bit Modulation Enable */
#define R_SCI_B_CCR2_HA_H_CKS_SHIFT (4)
#define R_SCI_B_CCR2_HA_H_CKS_MASK (0x3)
#  define R_SCI_B_CCR2_HA_H_CKS_TCLK_CLOCK (0 << R_SCI_B_CCR2_HA_H_CKS_SHIFT)     /* TCLK clock */
#  define R_SCI_B_CCR2_HA_H_CKS_TCLK_4_CLOCK (1 << R_SCI_B_CCR2_HA_H_CKS_SHIFT)   /* TCLK/4 clock */
#  define R_SCI_B_CCR2_HA_H_CKS_TCLK_16_CLOCK (2 << R_SCI_B_CCR2_HA_H_CKS_SHIFT)  /* TCLK/16 clock */
#  define R_SCI_B_CCR2_HA_H_CKS_TCLK_64_CLOCK (3 << R_SCI_B_CCR2_HA_H_CKS_SHIFT)  /* TCLK/64 clock */
#define R_SCI_B_CCR2_HA_H_MDDR_SHIFT (8)
#define R_SCI_B_CCR2_HA_H_MDDR_MASK (0xff)

/* Common Control Register 2 (8-bits) ***************************************/

