apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_CCR2_BY_HL_BRME (1 <<  0)                                           /* 01: Bit Modulation Enable */
#define R_SCI_B_CCR2_BY_HL_CKS_SHIFT (4)
#define R_SCI_B_CCR2_BY_HL_CKS_MASK (0x3)
#  define R_SCI_B_CCR2_BY_HL_CKS_TCLK_CLOCK (0 << R_SCI_B_CCR2_BY_HL_CKS_SHIFT)     /* TCLK clock */
#  define R_SCI_B_CCR2_BY_HL_CKS_TCLK_4_CLOCK (1 << R_SCI_B_CCR2_BY_HL_CKS_SHIFT)   /* TCLK/4 clock */
#  define R_SCI_B_CCR2_BY_HL_CKS_TCLK_16_CLOCK (2 << R_SCI_B_CCR2_BY_HL_CKS_SHIFT)  /* TCLK/16 clock */
#  define R_SCI_B_CCR2_BY_HL_CKS_TCLK_64_CLOCK (3 << R_SCI_B_CCR2_BY_HL_CKS_SHIFT)  /* TCLK/64 clock */

/* Common Control Register 2 (8-bits) ***************************************/

#define R_SCI_B_CCR2_BY_HH_MDDR_SHIFT (0)
#define R_SCI_B_CCR2_BY_HH_MDDR_MASK (0xff)

/* Common Control Register 3 (32-bits) **************************************/

#define R_SCI_B_CCR3_CPHA (1 <<  0)                                            /* 01: Clock Phase Setting */
#define R_SCI_B_CCR3_CPOL (1 <<  1)                                            /* 02: Clock Polarity Setting */
#define R_SCI_B_CCR3_BPEN (1 <<  7)                                            /* 80: Synchronizer ByPass Enable */
#define R_SCI_B_CCR3_CHR_SHIFT (8)
#define R_SCI_B_CCR3_CHR_MASK (0x3)
#  define R_SCI_B_CCR3_CHR_V00 (0 << R_SCI_B_CCR3_CHR_SHIFT)                   /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_CHR_V01 (1 << R_SCI_B_CCR3_CHR_SHIFT)                   /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_CHR_V10 (2 << R_SCI_B_CCR3_CHR_SHIFT)                   /* Transmit/receive in 8-bit length */
#  define R_SCI_B_CCR3_CHR_V11 (3 << R_SCI_B_CCR3_CHR_SHIFT)                   /* Transmit/receive in 7-bit length */
#define R_SCI_B_CCR3_LSBF (1 << 12)                                            /* 1000: LSB first select bit */
#define R_SCI_B_CCR3_SINV (1 << 13)                                            /* 2000: Transmitted/Received Data Invert */
#define R_SCI_B_CCR3_STP (1 << 14)                                             /* 4000: Stop Bit Length */
#define R_SCI_B_CCR3_RXDESEL (1 << 15)                                         /* 8000: Asynchronous Start Bit Edge Detection Select */
#define R_SCI_B_CCR3_MOD_SHIFT (16)
#define R_SCI_B_CCR3_MOD_MASK (0x7)
#  define R_SCI_B_CCR3_MOD_ASYNCHRONOUS (0 << R_SCI_B_CCR3_MOD_SHIFT)          /* Asynchronous */
#  define R_SCI_B_CCR3_MOD_SMART_CARD_INTERFACE (1 << R_SCI_B_CCR3_MOD_SHIFT)  /* Smart card interface */
#  define R_SCI_B_CCR3_MOD_CLOCK_SNCHRONOUS (2 << R_SCI_B_CCR3_MOD_SHIFT)      /* Clock snchronous */
#  define R_SCI_B_CCR3_MOD_SIMPLE_SPI (3 << R_SCI_B_CCR3_MOD_SHIFT)            /* Simple-SPI */
#  define R_SCI_B_CCR3_MOD_SIMPLE_I2C (4 << R_SCI_B_CCR3_MOD_SHIFT)            /* Simple-I2C */
#  define R_SCI_B_CCR3_MOD_MANCHESTER (5 << R_SCI_B_CCR3_MOD_SHIFT)            /* Manchester */
#  define R_SCI_B_CCR3_MOD_SIMPLE_LIN (6 << R_SCI_B_CCR3_MOD_SHIFT)            /* Simple-LIN */
#  define R_SCI_B_CCR3_MOD_PROHIBIT (7 << R_SCI_B_CCR3_MOD_SHIFT)              /* Prohibit */
#define R_SCI_B_CCR3_MP (1 << 19)                                              /* 80000: Multi-Processor mode */
#define R_SCI_B_CCR3_FM (1 << 20)                                              /* 100000: FIFO Mode Select */
#define R_SCI_B_CCR3_DEN (1 << 21)                                             /* 200000: Driver control Enable */
#define R_SCI_B_CCR3_CKE_SHIFT (24)
#define R_SCI_B_CCR3_CKE_MASK (0x3)
#  define R_SCI_B_CCR3_CKE_V00 (0 << R_SCI_B_CCR3_CKE_SHIFT)                   /* On-chip baud rate generator / On-chip baud rate generator The SCKn pin functions as I/O port. / Output disabled (The SCKn pin is available for use as an I/O port */
#  define R_SCI_B_CCR3_CKE_V01 (1 << R_SCI_B_CCR3_CKE_SHIFT)                   /* On-chip baud rate generator */
#  define R_SCI_B_CCR3_CKE_CLOCK_OUTPUT (1 << R_SCI_B_CCR3_CKE_SHIFT)          /* Clock output */
#  define R_SCI_B_CCR3_CKE_OUTPUT_FIXED_LOW (0 << R_SCI_B_CCR3_CKE_SHIFT)      /* Output fixed low */
#  define R_SCI_B_CCR3_CKE_OUTPUT_FIXED_HIGH (2 << R_SCI_B_CCR3_CKE_SHIFT)     /* Output fixed high */
#define R_SCI_B_CCR3_ACS0 (1 << 26)                                            /* 4000000: Asynchronous Mode Clock Source Select */
#define R_SCI_B_CCR3_GM (1 << 28)                                              /* 10000000: GSM Mode */
#define R_SCI_B_CCR3_BLK (1 << 29)                                             /* 20000000: Block transfer mode */

/* Common Control Register 3 (16-bits) **************************************/

#define R_SCI_B_CCR3_HA_L_CPHA (1 <<  0)                                /* 01: Clock Phase Setting */
#define R_SCI_B_CCR3_HA_L_CPOL (1 <<  1)                                /* 02: Clock Polarity Setting */
#define R_SCI_B_CCR3_HA_L_BPEN (1 <<  7)                                /* 80: Synchronizer ByPass Enable */
#define R_SCI_B_CCR3_HA_L_CHR_SHIFT (8)
#define R_SCI_B_CCR3_HA_L_CHR_MASK (0x3)
#  define R_SCI_B_CCR3_HA_L_CHR_V00 (0 << R_SCI_B_CCR3_HA_L_CHR_SHIFT)  /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_HA_L_CHR_V01 (1 << R_SCI_B_CCR3_HA_L_CHR_SHIFT)  /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_HA_L_CHR_V10 (2 << R_SCI_B_CCR3_HA_L_CHR_SHIFT)  /* Transmit/receive in 8-bit length */
#  define R_SCI_B_CCR3_HA_L_CHR_V11 (3 << R_SCI_B_CCR3_HA_L_CHR_SHIFT)  /* Transmit/receive in 7-bit length */
#define R_SCI_B_CCR3_HA_L_LSBF (1 << 12)                                /* 1000: LSB first select bit */
#define R_SCI_B_CCR3_HA_L_SINV (1 << 13)                                /* 2000: Transmitted/Received Data Invert */
#define R_SCI_B_CCR3_HA_L_STP (1 << 14)                                 /* 4000: Stop Bit Length */
#define R_SCI_B_CCR3_HA_L_RXDESEL (1 << 15)                             /* 8000: Asynchronous Start Bit Edge Detection Select */

/* Common Control Register 3 (8-bits) ***************************************/

#define R_SCI_B_CCR3_BY_LL_CPHA (1 <<  0)  /* 01: Clock Phase Setting */
#define R_SCI_B_CCR3_BY_LL_CPOL (1 <<  1)  /* 02: Clock Polarity Setting */
#define R_SCI_B_CCR3_BY_LL_BPEN (1 <<  7)  /* 80: Synchronizer ByPass Enable */

/* Common Control Register 3 (8-bits) ***************************************/

#define R_SCI_B_CCR3_BY_LH_CHR_SHIFT (0)
#define R_SCI_B_CCR3_BY_LH_CHR_MASK (0x3)
#  define R_SCI_B_CCR3_BY_LH_CHR_V00 (0 << R_SCI_B_CCR3_BY_LH_CHR_SHIFT)  /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_BY_LH_CHR_V01 (1 << R_SCI_B_CCR3_BY_LH_CHR_SHIFT)  /* Transmit/receive in 9-bit length */
#  define R_SCI_B_CCR3_BY_LH_CHR_V10 (2 << R_SCI_B_CCR3_BY_LH_CHR_SHIFT)  /* Transmit/receive in 8-bit length */
#  define R_SCI_B_CCR3_BY_LH_CHR_V11 (3 << R_SCI_B_CCR3_BY_LH_CHR_SHIFT)  /* Transmit/receive in 7-bit length */
#define R_SCI_B_CCR3_BY_LH_LSBF (1 <<  4)                                 /* 10: LSB first select bit */
#define R_SCI_B_CCR3_BY_LH_SINV (1 <<  5)                                 /* 20: Transmitted/Received Data Invert */
#define R_SCI_B_CCR3_BY_LH_STP (1 <<  6)                                  /* 40: Stop Bit Length */
#define R_SCI_B_CCR3_BY_LH_RXDESEL (1 <<  7)                              /* 80: Asynchronous Start Bit Edge Detection Select */

