apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* Common Control Register 3 (16-bits) **************************************/

#define R_SCI_B_CCR3_HA_H_MOD_SHIFT (0)
#define R_SCI_B_CCR3_HA_H_MOD_MASK (0x7)
#  define R_SCI_B_CCR3_HA_H_MOD_ASYNCHRONOUS (0 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)          /* Asynchronous */
#  define R_SCI_B_CCR3_HA_H_MOD_SMART_CARD_INTERFACE (1 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)  /* Smart card interface */
#  define R_SCI_B_CCR3_HA_H_MOD_CLOCK_SNCHRONOUS (2 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)      /* Clock snchronous */
#  define R_SCI_B_CCR3_HA_H_MOD_SIMPLE_SPI (3 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)            /* Simple-SPI */
#  define R_SCI_B_CCR3_HA_H_MOD_SIMPLE_I2C (4 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)            /* Simple-I2C */
#  define R_SCI_B_CCR3_HA_H_MOD_MANCHESTER (5 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)            /* Manchester */
#  define R_SCI_B_CCR3_HA_H_MOD_SIMPLE_LIN (6 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)            /* Simple-LIN */
#  define R_SCI_B_CCR3_HA_H_MOD_PROHIBIT (7 << R_SCI_B_CCR3_HA_H_MOD_SHIFT)              /* Prohibit */
#define R_SCI_B_CCR3_HA_H_MP (1 <<  3)                                                   /* 08: Multi-Processor mode */
#define R_SCI_B_CCR3_HA_H_FM (1 <<  4)                                                   /* 10: FIFO Mode Select */
#define R_SCI_B_CCR3_HA_H_DEN (1 <<  5)                                                  /* 20: Driver control Enable */
#define R_SCI_B_CCR3_HA_H_CKE_SHIFT (8)
#define R_SCI_B_CCR3_HA_H_CKE_MASK (0x3)
#  define R_SCI_B_CCR3_HA_H_CKE_V00 (0 << R_SCI_B_CCR3_HA_H_CKE_SHIFT)                   /* On-chip baud rate generator / On-chip baud rate generator The SCKn pin functions as I/O port. / Output disabled (The SCKn pin is available for use as an I/O port */
#  define R_SCI_B_CCR3_HA_H_CKE_V01 (1 << R_SCI_B_CCR3_HA_H_CKE_SHIFT)                   /* On-chip baud rate generator */
#  define R_SCI_B_CCR3_HA_H_CKE_CLOCK_OUTPUT (1 << R_SCI_B_CCR3_HA_H_CKE_SHIFT)          /* Clock output */
#  define R_SCI_B_CCR3_HA_H_CKE_OUTPUT_FIXED_LOW (0 << R_SCI_B_CCR3_HA_H_CKE_SHIFT)      /* Output fixed low */
#  define R_SCI_B_CCR3_HA_H_CKE_OUTPUT_FIXED_HIGH (2 << R_SCI_B_CCR3_HA_H_CKE_SHIFT)     /* Output fixed high */
#define R_SCI_B_CCR3_HA_H_ACS0 (1 << 10)                                                 /* 400: Asynchronous Mode Clock Source Select */
#define R_SCI_B_CCR3_HA_H_GM (1 << 12)                                                   /* 1000: GSM Mode */
#define R_SCI_B_CCR3_HA_H_BLK (1 << 13)                                                  /* 2000: Block transfer mode */

/* Common Control Register 3 (8-bits) ***************************************/

#define R_SCI_B_CCR3_BY_HL_MOD_SHIFT (0)
#define R_SCI_B_CCR3_BY_HL_MOD_MASK (0x7)
#  define R_SCI_B_CCR3_BY_HL_MOD_ASYNCHRONOUS (0 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)          /* Asynchronous */
#  define R_SCI_B_CCR3_BY_HL_MOD_SMART_CARD_INTERFACE (1 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)  /* Smart card interface */
#  define R_SCI_B_CCR3_BY_HL_MOD_CLOCK_SNCHRONOUS (2 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)      /* Clock snchronous */
#  define R_SCI_B_CCR3_BY_HL_MOD_SIMPLE_SPI (3 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)            /* Simple-SPI */
#  define R_SCI_B_CCR3_BY_HL_MOD_SIMPLE_I2C (4 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)            /* Simple-I2C */
#  define R_SCI_B_CCR3_BY_HL_MOD_MANCHESTER (5 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)            /* Manchester */
#  define R_SCI_B_CCR3_BY_HL_MOD_SIMPLE_LIN (6 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)            /* Simple-LIN */
#  define R_SCI_B_CCR3_BY_HL_MOD_PROHIBIT (7 << R_SCI_B_CCR3_BY_HL_MOD_SHIFT)              /* Prohibit */
#define R_SCI_B_CCR3_BY_HL_MP (1 <<  3)                                                    /* 08: Multi-Processor mode */
#define R_SCI_B_CCR3_BY_HL_FM (1 <<  4)                                                    /* 10: FIFO Mode Select */
#define R_SCI_B_CCR3_BY_HL_DEN (1 <<  5)                                                   /* 20: Driver control Enable */

/* Common Control Register 3 (8-bits) ***************************************/

#define R_SCI_B_CCR3_BY_HH_CKE_SHIFT (0)
#define R_SCI_B_CCR3_BY_HH_CKE_MASK (0x3)
#  define R_SCI_B_CCR3_BY_HH_CKE_V00 (0 << R_SCI_B_CCR3_BY_HH_CKE_SHIFT)                /* On-chip baud rate generator / On-chip baud rate generator The SCKn pin functions as I/O port. / Output disabled (The SCKn pin is available for use as an I/O port */
#  define R_SCI_B_CCR3_BY_HH_CKE_V01 (1 << R_SCI_B_CCR3_BY_HH_CKE_SHIFT)                /* On-chip baud rate generator */
#  define R_SCI_B_CCR3_BY_HH_CKE_CLOCK_OUTPUT (1 << R_SCI_B_CCR3_BY_HH_CKE_SHIFT)       /* Clock output */
#  define R_SCI_B_CCR3_BY_HH_CKE_OUTPUT_FIXED_LOW (0 << R_SCI_B_CCR3_BY_HH_CKE_SHIFT)   /* Output fixed low */
#  define R_SCI_B_CCR3_BY_HH_CKE_OUTPUT_FIXED_HIGH (2 << R_SCI_B_CCR3_BY_HH_CKE_SHIFT)  /* Output fixed high */
#define R_SCI_B_CCR3_BY_HH_ACS0 (1 <<  2)                                               /* 04: Asynchronous Mode Clock Source Select */
#define R_SCI_B_CCR3_BY_HH_GM (1 <<  4)                                                 /* 10: GSM Mode */
#define R_SCI_B_CCR3_BY_HH_BLK (1 <<  5)                                                /* 20: Block transfer mode */

/* Common Control Register 4 (32-bits) **************************************/

#define R_SCI_B_CCR4_CMPD_SHIFT (0)
#define R_SCI_B_CCR4_CMPD_MASK (0x1ff)
#define R_SCI_B_CCR4_ASEN (1 << 16)                                     /* 10000: Adjustment enable bit for sampling timing */
#define R_SCI_B_CCR4_ATEN (1 << 17)                                     /* 20000: Adjustment enable bit for transmit waveform */
#define R_SCI_B_CCR4_AST_SHIFT (24)
#define R_SCI_B_CCR4_AST_MASK (0x7)
#  define R_SCI_B_CCR4_AST_V000 (0 << R_SCI_B_CCR4_AST_SHIFT)           /* No adjustment (The sampling at default timing) */
#define R_SCI_B_CCR4_AJD (1 << 27)                                      /* 8000000: Adjustment Direction for sampling timing */
#define R_SCI_B_CCR4_ATT_SHIFT (28)
#define R_SCI_B_CCR4_ATT_MASK (0x7)
#  define R_SCI_B_CCR4_ATT_NO_ADJUSTMENT (0 << R_SCI_B_CCR4_ATT_SHIFT)  /* No adjustment */
#define R_SCI_B_CCR4_AET (1 << 31)                                      /* 80000000: Adjustment Duty control level select */

/* Common Control Register 4 (16-bits) **************************************/

