apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_CCR4_HA_L_CMPD_SHIFT (0)
#define R_SCI_B_CCR4_HA_L_CMPD_MASK (0x1ff)

/* Common Control Register 4 (8-bits) ***************************************/

#define R_SCI_B_CCR4_BY_LL_CMPD_SHIFT (0)
#define R_SCI_B_CCR4_BY_LL_CMPD_MASK (0xff)

/* Common Control Register 4 (8-bits) ***************************************/

#define R_SCI_B_CCR4_BY_LH_CMPD (1 <<  0)  /* 01: Compare Match Data */

/* Common Control Register 4 (16-bits) **************************************/

#define R_SCI_B_CCR4_HA_H_ASEN (1 <<  0)                                          /* 01: Adjustment enable bit for sampling timing */
#define R_SCI_B_CCR4_HA_H_ATEN (1 <<  1)                                          /* 02: Adjustment enable bit for transmit waveform */
#define R_SCI_B_CCR4_HA_H_AST_SHIFT (8)
#define R_SCI_B_CCR4_HA_H_AST_MASK (0x7)
#  define R_SCI_B_CCR4_HA_H_AST_V000 (0 << R_SCI_B_CCR4_HA_H_AST_SHIFT)           /* No adjustment (The sampling at default timing) */
#define R_SCI_B_CCR4_HA_H_AJD (1 << 11)                                           /* 800: Adjustment Direction for sampling timing */
#define R_SCI_B_CCR4_HA_H_ATT_SHIFT (12)
#define R_SCI_B_CCR4_HA_H_ATT_MASK (0x7)
#  define R_SCI_B_CCR4_HA_H_ATT_NO_ADJUSTMENT (0 << R_SCI_B_CCR4_HA_H_ATT_SHIFT)  /* No adjustment */
#define R_SCI_B_CCR4_HA_H_AET (1 << 15)                                           /* 8000: Adjustment Duty control level select */

/* Common Control Register 4 (8-bits) ***************************************/

#define R_SCI_B_CCR4_BY_HL_ASEN (1 <<  0)  /* 01: Adjustment enable bit for sampling timing */
#define R_SCI_B_CCR4_BY_HL_ATEN (1 <<  1)  /* 02: Adjustment enable bit for transmit waveform */

/* Common Control Register 4 (8-bits) ***************************************/

#define R_SCI_B_CCR4_BY_HH_AST_SHIFT (0)
#define R_SCI_B_CCR4_BY_HH_AST_MASK (0x7)
#  define R_SCI_B_CCR4_BY_HH_AST_V000 (0 << R_SCI_B_CCR4_BY_HH_AST_SHIFT)           /* No adjustment (The sampling at default timing) */
#define R_SCI_B_CCR4_BY_HH_AJD (1 <<  3)                                            /* 08: Adjustment Direction for sampling timing */
#define R_SCI_B_CCR4_BY_HH_ATT_SHIFT (4)
#define R_SCI_B_CCR4_BY_HH_ATT_MASK (0x7)
#  define R_SCI_B_CCR4_BY_HH_ATT_NO_ADJUSTMENT (0 << R_SCI_B_CCR4_BY_HH_ATT_SHIFT)  /* No adjustment */
#define R_SCI_B_CCR4_BY_HH_AET (1 <<  7)                                            /* 80: Adjustment Duty control level select */

/* Communication Enable Status Register (8-bits) ****************************/

#define R_SCI_B_CESR_RIST (1 <<  0)  /* 01: Internal status of RE signal */
#define R_SCI_B_CESR_TIST (1 <<  4)  /* 10: Internal status of TE signal */

/* HBS valid mode Control Register (8-bits) *********************************/

#define R_SCI_B_HCR_HDEN (1 <<  0)  /* 01: HDC valid mode Enable */
#define R_SCI_B_HCR_HDOC (1 <<  2)  /* 04: HDC valid mode Output Control */
#define R_SCI_B_HCR_HDST (1 <<  3)  /* 08: HDC valid mode STart bit */
#define R_SCI_B_HCR_HDIC (1 <<  4)  /* 10: HDC valid mode start bit Initialize Control */

/* Simple-I2C Control Register (32-bits) ************************************/

#define R_SCI_B_ICR_IICDL_SHIFT (0)
#define R_SCI_B_ICR_IICDL_MASK (0x1f)
#  define R_SCI_B_ICR_IICDL_NO_OUTPUT_DELAY (0 << R_SCI_B_ICR_IICDL_SHIFT)          /* No output delay */
#define R_SCI_B_ICR_IICINTM (1 <<  8)                                               /* 100: I2C Interrupt Mode Select */
#define R_SCI_B_ICR_IICCSC (1 <<  9)                                                /* 200: Clock Synchronization */
#define R_SCI_B_ICR_IICACKT (1 << 13)                                               /* 2000: ACK Transmission Data */
#define R_SCI_B_ICR_IICSTAREQ (1 << 16)                                             /* 10000: Start Condition Generation */
#define R_SCI_B_ICR_IICRSTAREQ (1 << 17)                                            /* 20000: Restart Condition Generation */
#define R_SCI_B_ICR_IICSTPREQ (1 << 18)                                             /* 40000: Stop Condition Generation */
#define R_SCI_B_ICR_IICSDAS_SHIFT (20)
#define R_SCI_B_ICR_IICSDAS_MASK (0x3)
#  define R_SCI_B_ICR_IICSDAS_SERIAL_DATA_OUTPUT (0 << R_SCI_B_ICR_IICSDAS_SHIFT)   /* Serial data output */
#  define R_SCI_B_ICR_IICSDAS_V01 (1 << R_SCI_B_ICR_IICSDAS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_IICSDAS_V10 (2 << R_SCI_B_ICR_IICSDAS_SHIFT)                  /* Output the low level on the SSDAn pin. */
#  define R_SCI_B_ICR_IICSDAS_V11 (3 << R_SCI_B_ICR_IICSDAS_SHIFT)                  /* Place the SSDAn pin in the high-impedance state. */
#define R_SCI_B_ICR_IICSCLS_SHIFT (22)
#define R_SCI_B_ICR_IICSCLS_MASK (0x3)
#  define R_SCI_B_ICR_IICSCLS_SERIAL_CLOCK_OUTPUT (0 << R_SCI_B_ICR_IICSCLS_SHIFT)  /* Serial clock output */
#  define R_SCI_B_ICR_IICSCLS_V01 (1 << R_SCI_B_ICR_IICSCLS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_IICSCLS_V10 (2 << R_SCI_B_ICR_IICSCLS_SHIFT)                  /* Output the low level on the SSCLn pin. */
#  define R_SCI_B_ICR_IICSCLS_V11 (3 << R_SCI_B_ICR_IICSCLS_SHIFT)                  /* Place the SSCLn pin in the high-impedance state. */

/* Simple-I2C Control Register (16-bits) ************************************/

#define R_SCI_B_ICR_HA_L_IICDL_SHIFT (0)
#define R_SCI_B_ICR_HA_L_IICDL_MASK (0x1f)
#  define R_SCI_B_ICR_HA_L_IICDL_NO_OUTPUT_DELAY (0 << R_SCI_B_ICR_HA_L_IICDL_SHIFT)  /* No output delay */
#define R_SCI_B_ICR_HA_L_IICINTM (1 <<  8)                                            /* 100: I2C Interrupt Mode Select */
#define R_SCI_B_ICR_HA_L_IICCSC (1 <<  9)                                             /* 200: Clock Synchronization */
#define R_SCI_B_ICR_HA_L_IICACKT (1 << 13)                                            /* 2000: ACK Transmission Data */

/* Simple-I2C Control Register (8-bits) *************************************/

#define R_SCI_B_ICR_BY_LL_IICDL_SHIFT (0)
#define R_SCI_B_ICR_BY_LL_IICDL_MASK (0x1f)
#  define R_SCI_B_ICR_BY_LL_IICDL_NO_OUTPUT_DELAY (0 << R_SCI_B_ICR_BY_LL_IICDL_SHIFT)  /* No output delay */

