apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* Simple-I2C Control Register (8-bits) *************************************/

#define R_SCI_B_ICR_BY_LH_IICINTM (1 <<  0)  /* 01: I2C Interrupt Mode Select */
#define R_SCI_B_ICR_BY_LH_IICCSC (1 <<  1)   /* 02: Clock Synchronization */
#define R_SCI_B_ICR_BY_LH_IICACKT (1 <<  5)  /* 20: ACK Transmission Data */

/* Simple-I2C Control Register (16-bits) ************************************/

#define R_SCI_B_ICR_HA_H_IICSTAREQ (1 <<  0)                                                  /* 01: Start Condition Generation */
#define R_SCI_B_ICR_HA_H_IICRSTAREQ (1 <<  1)                                                 /* 02: Restart Condition Generation */
#define R_SCI_B_ICR_HA_H_IICSTPREQ (1 <<  2)                                                  /* 04: Stop Condition Generation */
#define R_SCI_B_ICR_HA_H_IICSDAS_SHIFT (4)
#define R_SCI_B_ICR_HA_H_IICSDAS_MASK (0x3)
#  define R_SCI_B_ICR_HA_H_IICSDAS_SERIAL_DATA_OUTPUT (0 << R_SCI_B_ICR_HA_H_IICSDAS_SHIFT)   /* Serial data output */
#  define R_SCI_B_ICR_HA_H_IICSDAS_V01 (1 << R_SCI_B_ICR_HA_H_IICSDAS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_HA_H_IICSDAS_V10 (2 << R_SCI_B_ICR_HA_H_IICSDAS_SHIFT)                  /* Output the low level on the SSDAn pin. */
#  define R_SCI_B_ICR_HA_H_IICSDAS_V11 (3 << R_SCI_B_ICR_HA_H_IICSDAS_SHIFT)                  /* Place the SSDAn pin in the high-impedance state. */
#define R_SCI_B_ICR_HA_H_IICSCLS_SHIFT (6)
#define R_SCI_B_ICR_HA_H_IICSCLS_MASK (0x3)
#  define R_SCI_B_ICR_HA_H_IICSCLS_SERIAL_CLOCK_OUTPUT (0 << R_SCI_B_ICR_HA_H_IICSCLS_SHIFT)  /* Serial clock output */
#  define R_SCI_B_ICR_HA_H_IICSCLS_V01 (1 << R_SCI_B_ICR_HA_H_IICSCLS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_HA_H_IICSCLS_V10 (2 << R_SCI_B_ICR_HA_H_IICSCLS_SHIFT)                  /* Output the low level on the SSCLn pin. */
#  define R_SCI_B_ICR_HA_H_IICSCLS_V11 (3 << R_SCI_B_ICR_HA_H_IICSCLS_SHIFT)                  /* Place the SSCLn pin in the high-impedance state. */

/* Simple-I2C Control Register (8-bits) *************************************/

#define R_SCI_B_ICR_BY_HL_IICSTAREQ (1 <<  0)                                                   /* 01: Start Condition Generation */
#define R_SCI_B_ICR_BY_HL_IICRSTAREQ (1 <<  1)                                                  /* 02: Restart Condition Generation */
#define R_SCI_B_ICR_BY_HL_IICSTPREQ (1 <<  2)                                                   /* 04: Stop Condition Generation */
#define R_SCI_B_ICR_BY_HL_IICSDAS_SHIFT (4)
#define R_SCI_B_ICR_BY_HL_IICSDAS_MASK (0x3)
#  define R_SCI_B_ICR_BY_HL_IICSDAS_SERIAL_DATA_OUTPUT (0 << R_SCI_B_ICR_BY_HL_IICSDAS_SHIFT)   /* Serial data output */
#  define R_SCI_B_ICR_BY_HL_IICSDAS_V01 (1 << R_SCI_B_ICR_BY_HL_IICSDAS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_BY_HL_IICSDAS_V10 (2 << R_SCI_B_ICR_BY_HL_IICSDAS_SHIFT)                  /* Output the low level on the SSDAn pin. */
#  define R_SCI_B_ICR_BY_HL_IICSDAS_V11 (3 << R_SCI_B_ICR_BY_HL_IICSDAS_SHIFT)                  /* Place the SSDAn pin in the high-impedance state. */
#define R_SCI_B_ICR_BY_HL_IICSCLS_SHIFT (6)
#define R_SCI_B_ICR_BY_HL_IICSCLS_MASK (0x3)
#  define R_SCI_B_ICR_BY_HL_IICSCLS_SERIAL_CLOCK_OUTPUT (0 << R_SCI_B_ICR_BY_HL_IICSCLS_SHIFT)  /* Serial clock output */
#  define R_SCI_B_ICR_BY_HL_IICSCLS_V01 (1 << R_SCI_B_ICR_BY_HL_IICSCLS_SHIFT)                  /* Generate a start, restart, or stop condition. */
#  define R_SCI_B_ICR_BY_HL_IICSCLS_V10 (2 << R_SCI_B_ICR_BY_HL_IICSCLS_SHIFT)                  /* Output the low level on the SSCLn pin. */
#  define R_SCI_B_ICR_BY_HL_IICSCLS_V11 (3 << R_SCI_B_ICR_BY_HL_IICSCLS_SHIFT)                  /* Place the SSCLn pin in the high-impedance state. */

/* FIFO Control Register (32-bits) ******************************************/

#define R_SCI_B_FCR_DRES (1 <<  0)   /* 01: Receive data ready error select bit */
#define R_SCI_B_FCR_TTRG_SHIFT (8)
#define R_SCI_B_FCR_TTRG_MASK (0x1f)
#define R_SCI_B_FCR_TFRST (1 << 15)  /* 8000: Transmit FIFO Data Register Reset */
#define R_SCI_B_FCR_RTRG_SHIFT (16)
#define R_SCI_B_FCR_RTRG_MASK (0x1f)
#define R_SCI_B_FCR_RFRST (1 << 23)  /* 800000: Receive FIFO Data Register Reset */
#define R_SCI_B_FCR_RSTRG_SHIFT (24)
#define R_SCI_B_FCR_RSTRG_MASK (0x1f)

/* FIFO Control Register (16-bits) ******************************************/

#define R_SCI_B_FCR_HA_L_DRES (1 <<  0)   /* 01: Receive data ready error select bit */
#define R_SCI_B_FCR_HA_L_TTRG_SHIFT (8)
#define R_SCI_B_FCR_HA_L_TTRG_MASK (0x1f)
#define R_SCI_B_FCR_HA_L_TFRST (1 << 15)  /* 8000: Transmit FIFO Data Register Reset */

/* FIFO Control Register (8-bits) *******************************************/

#define R_SCI_B_FCR_BY_LL_DRES (1 <<  0)  /* 01: Receive data ready error select bit */

/* FIFO Control Register (8-bits) *******************************************/

#define R_SCI_B_FCR_BY_LH_TTRG_SHIFT (0)
#define R_SCI_B_FCR_BY_LH_TTRG_MASK (0x1f)
#define R_SCI_B_FCR_BY_LH_TFRST (1 <<  7)  /* 80: Transmit FIFO Data Register Reset */

/* FIFO Control Register (16-bits) ******************************************/

#define R_SCI_B_FCR_HA_H_RTRG_SHIFT (0)
#define R_SCI_B_FCR_HA_H_RTRG_MASK (0x1f)
#define R_SCI_B_FCR_HA_H_RFRST (1 <<  7)  /* 80: Receive FIFO Data Register Reset */
#define R_SCI_B_FCR_HA_H_RSTRG_SHIFT (8)
#define R_SCI_B_FCR_HA_H_RSTRG_MASK (0x1f)

/* FIFO Control Register (8-bits) *******************************************/

#define R_SCI_B_FCR_BY_HL_RTRG_SHIFT (0)
#define R_SCI_B_FCR_BY_HL_RTRG_MASK (0x1f)
#define R_SCI_B_FCR_BY_HL_RFRST (1 <<  7)  /* 80: Receive FIFO Data Register Reset */

/* FIFO Control Register (8-bits) *******************************************/

#define R_SCI_B_FCR_BY_HH_RSTRG_SHIFT (0)
#define R_SCI_B_FCR_BY_HH_RSTRG_MASK (0x1f)

/* Manchester Control Register (32-bits) ************************************/

#define R_SCI_B_MCR_RMPOL (1 <<  0)                                  /* 01: Receive Manchester polarity */
#define R_SCI_B_MCR_TMPOL (1 <<  1)                                  /* 02: Transmission Manchester polarity */
#define R_SCI_B_MCR_ERTEN (1 <<  2)                                  /* 04: Manchester edge retiming enable */
#define R_SCI_B_MCR_SYNVAL (1 <<  4)                                 /* 10: Sync type of Manchester code start bit is set. */
#define R_SCI_B_MCR_SYNSEL (1 <<  5)                                 /* 20: Sync select */
#define R_SCI_B_MCR_SBSEL (1 <<  6)                                  /* 40: Start bit select */
#define R_SCI_B_MCR_TPLEN_SHIFT (8)
#define R_SCI_B_MCR_TPLEN_MASK (0xf)
#  define R_SCI_B_MCR_TPLEN_V0 (0 << R_SCI_B_MCR_TPLEN_SHIFT)        /* Transmit preface generation disabled. */
#define R_SCI_B_MCR_TPPAT_SHIFT (12)
#define R_SCI_B_MCR_TPPAT_MASK (0x3)
#  define R_SCI_B_MCR_TPPAT_ALL_ZERO (0 << R_SCI_B_MCR_TPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_TPPAT_ZERO_ONE (1 << R_SCI_B_MCR_TPPAT_SHIFT)  /* ZERO ONE */
#define R_SCI_B_MCR_RPLEN_SHIFT (16)
#define R_SCI_B_MCR_RPLEN_MASK (0xf)
#  define R_SCI_B_MCR_RPLEN_V0 (0 << R_SCI_B_MCR_RPLEN_SHIFT)        /* Receive preface generation disabled. */
#define R_SCI_B_MCR_RPPAT_SHIFT (20)
#define R_SCI_B_MCR_RPPAT_MASK (0x3)
#  define R_SCI_B_MCR_RPPAT_ALL_ZERO (0 << R_SCI_B_MCR_RPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_RPPAT_ZERO_ONE (1 << R_SCI_B_MCR_RPPAT_SHIFT)  /* ZERO ONE */
#  define R_SCI_B_MCR_RPPAT_ONE_ZERO (2 << R_SCI_B_MCR_RPPAT_SHIFT)  /* ONE ZERO */
#  define R_SCI_B_MCR_RPPAT_ALL_ONE (3 << R_SCI_B_MCR_RPPAT_SHIFT)   /* ALL ONE */
#define R_SCI_B_MCR_PFEREN (1 << 24)                                 /* 1000000: Preface Error enable */
#define R_SCI_B_MCR_SYEREN (1 << 25)                                 /* 2000000: Sync Error enable */
#define R_SCI_B_MCR_SBEREN (1 << 26)                                 /* 4000000: Start bit error enable */

/* Manchester Control Register (16-bits) ************************************/

#define R_SCI_B_MCR_HA_L_RMPOL (1 <<  0)                                       /* 01: Receive Manchester polarity */
#define R_SCI_B_MCR_HA_L_TMPOL (1 <<  1)                                       /* 02: Transmission Manchester polarity */
#define R_SCI_B_MCR_HA_L_ERTEN (1 <<  2)                                       /* 04: Manchester edge retiming enable */
#define R_SCI_B_MCR_HA_L_SYNVAL (1 <<  4)                                      /* 10: Sync type of Manchester code start bit is set. */
#define R_SCI_B_MCR_HA_L_SYNSEL (1 <<  5)                                      /* 20: Sync select */
#define R_SCI_B_MCR_HA_L_SBSEL (1 <<  6)                                       /* 40: Start bit select */
#define R_SCI_B_MCR_HA_L_TPLEN_SHIFT (8)
#define R_SCI_B_MCR_HA_L_TPLEN_MASK (0xf)
#  define R_SCI_B_MCR_HA_L_TPLEN_V0 (0 << R_SCI_B_MCR_HA_L_TPLEN_SHIFT)        /* Transmit preface generation disabled. */
#define R_SCI_B_MCR_HA_L_TPPAT_SHIFT (12)
#define R_SCI_B_MCR_HA_L_TPPAT_MASK (0x3)
#  define R_SCI_B_MCR_HA_L_TPPAT_ALL_ZERO (0 << R_SCI_B_MCR_HA_L_TPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_HA_L_TPPAT_ZERO_ONE (1 << R_SCI_B_MCR_HA_L_TPPAT_SHIFT)  /* ZERO ONE */

