apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
/* Manchester Control Register (8-bits) *************************************/

#define R_SCI_B_MCR_BY_LL_RMPOL (1 <<  0)   /* 01: Receive Manchester polarity */
#define R_SCI_B_MCR_BY_LL_TMPOL (1 <<  1)   /* 02: Transmission Manchester polarity */
#define R_SCI_B_MCR_BY_LL_ERTEN (1 <<  2)   /* 04: Manchester edge retiming enable */
#define R_SCI_B_MCR_BY_LL_SYNVAL (1 <<  4)  /* 10: Sync type of Manchester code start bit is set. */
#define R_SCI_B_MCR_BY_LL_SYNSEL (1 <<  5)  /* 20: Sync select */
#define R_SCI_B_MCR_BY_LL_SBSEL (1 <<  6)   /* 40: Start bit select */

/* Manchester Control Register (8-bits) *************************************/

#define R_SCI_B_MCR_BY_LH_TPLEN_SHIFT (0)
#define R_SCI_B_MCR_BY_LH_TPLEN_MASK (0xf)
#  define R_SCI_B_MCR_BY_LH_TPLEN_V0 (0 << R_SCI_B_MCR_BY_LH_TPLEN_SHIFT)        /* Transmit preface generation disabled. */
#define R_SCI_B_MCR_BY_LH_TPPAT_SHIFT (4)
#define R_SCI_B_MCR_BY_LH_TPPAT_MASK (0x3)
#  define R_SCI_B_MCR_BY_LH_TPPAT_ALL_ZERO (0 << R_SCI_B_MCR_BY_LH_TPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_BY_LH_TPPAT_ZERO_ONE (1 << R_SCI_B_MCR_BY_LH_TPPAT_SHIFT)  /* ZERO ONE */

/* Manchester Control Register (16-bits) ************************************/

#define R_SCI_B_MCR_HA_H_RPLEN_SHIFT (0)
#define R_SCI_B_MCR_HA_H_RPLEN_MASK (0xf)
#  define R_SCI_B_MCR_HA_H_RPLEN_V0 (0 << R_SCI_B_MCR_HA_H_RPLEN_SHIFT)        /* Receive preface generation disabled. */
#define R_SCI_B_MCR_HA_H_RPPAT_SHIFT (4)
#define R_SCI_B_MCR_HA_H_RPPAT_MASK (0x3)
#  define R_SCI_B_MCR_HA_H_RPPAT_ALL_ZERO (0 << R_SCI_B_MCR_HA_H_RPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_HA_H_RPPAT_ZERO_ONE (1 << R_SCI_B_MCR_HA_H_RPPAT_SHIFT)  /* ZERO ONE */
#  define R_SCI_B_MCR_HA_H_RPPAT_ONE_ZERO (2 << R_SCI_B_MCR_HA_H_RPPAT_SHIFT)  /* ONE ZERO */
#  define R_SCI_B_MCR_HA_H_RPPAT_ALL_ONE (3 << R_SCI_B_MCR_HA_H_RPPAT_SHIFT)   /* ALL ONE */
#define R_SCI_B_MCR_HA_H_PFEREN (1 <<  8)                                      /* 100: Preface Error enable */
#define R_SCI_B_MCR_HA_H_SYEREN (1 <<  9)                                      /* 200: Sync Error enable */
#define R_SCI_B_MCR_HA_H_SBEREN (1 << 10)                                      /* 400: Start bit error enable */

/* Manchester Control Register (8-bits) *************************************/

#define R_SCI_B_MCR_BY_HL_RPLEN_SHIFT (0)
#define R_SCI_B_MCR_BY_HL_RPLEN_MASK (0xf)
#  define R_SCI_B_MCR_BY_HL_RPLEN_V0 (0 << R_SCI_B_MCR_BY_HL_RPLEN_SHIFT)        /* Receive preface generation disabled. */
#define R_SCI_B_MCR_BY_HL_RPPAT_SHIFT (4)
#define R_SCI_B_MCR_BY_HL_RPPAT_MASK (0x3)
#  define R_SCI_B_MCR_BY_HL_RPPAT_ALL_ZERO (0 << R_SCI_B_MCR_BY_HL_RPPAT_SHIFT)  /* ALL ZERO */
#  define R_SCI_B_MCR_BY_HL_RPPAT_ZERO_ONE (1 << R_SCI_B_MCR_BY_HL_RPPAT_SHIFT)  /* ZERO ONE */
#  define R_SCI_B_MCR_BY_HL_RPPAT_ONE_ZERO (2 << R_SCI_B_MCR_BY_HL_RPPAT_SHIFT)  /* ONE ZERO */
#  define R_SCI_B_MCR_BY_HL_RPPAT_ALL_ONE (3 << R_SCI_B_MCR_BY_HL_RPPAT_SHIFT)   /* ALL ONE */

/* Manchester Control Register (8-bits) *************************************/

#define R_SCI_B_MCR_BY_HH_PFEREN (1 <<  0)  /* 01: Preface Error enable */
#define R_SCI_B_MCR_BY_HH_SYEREN (1 <<  1)  /* 02: Sync Error enable */
#define R_SCI_B_MCR_BY_HH_SBEREN (1 <<  2)  /* 04: Start bit error enable */

/* Driver Control Register (32-bits) ****************************************/

#define R_SCI_B_DCR_DEPOL (1 <<  0)  /* 01: Driver Enable POLarity select */
#define R_SCI_B_DCR_DEAST_SHIFT (8)
#define R_SCI_B_DCR_DEAST_MASK (0x1f)
#define R_SCI_B_DCR_DENGT_SHIFT (16)
#define R_SCI_B_DCR_DENGT_MASK (0x1f)

/* Driver Control Register (16-bits) ****************************************/

#define R_SCI_B_DCR_HA_L_DEPOL (1 <<  0)  /* 01: Driver Enable POLarity select */
#define R_SCI_B_DCR_HA_L_DEAST_SHIFT (8)
#define R_SCI_B_DCR_HA_L_DEAST_MASK (0x1f)

/* Driver Control Register (8-bits) *****************************************/

#define R_SCI_B_DCR_BY_LL_DEPOL (1 <<  0)  /* 01: Driver Enable POLarity select */

/* Driver Control Register (8-bits) *****************************************/

#define R_SCI_B_DCR_BY_LH_DEAST_SHIFT (0)
#define R_SCI_B_DCR_BY_LH_DEAST_MASK (0x1f)

/* Driver Control Register (16-bits) ****************************************/

#define R_SCI_B_DCR_HA_H_DENGT_SHIFT (0)
#define R_SCI_B_DCR_HA_H_DENGT_MASK (0x1f)

/* Driver Control Register (8-bits) *****************************************/

#define R_SCI_B_DCR_BY_HL_DENGT_SHIFT (0)
#define R_SCI_B_DCR_BY_HL_DENGT_MASK (0x1f)

/* Simple-LIN(SCIX) Control Register 0 (32-bits) ****************************/

#define R_SCI_B_XCR0_TCSS_SHIFT (0)
#define R_SCI_B_XCR0_TCSS_MASK (0x3)
#  define R_SCI_B_XCR0_TCSS_TCLK (0 << R_SCI_B_XCR0_TCSS_SHIFT)                   /* TCLK */
#  define R_SCI_B_XCR0_TCSS_TCLK_4 (1 << R_SCI_B_XCR0_TCSS_SHIFT)                 /* TCLK/4 */
#  define R_SCI_B_XCR0_TCSS_TCLK_16 (2 << R_SCI_B_XCR0_TCSS_SHIFT)                /* TCLK/16 */
#  define R_SCI_B_XCR0_TCSS_TCLK_64 (3 << R_SCI_B_XCR0_TCSS_SHIFT)                /* TCLK/64 */
#define R_SCI_B_XCR0_BFE (1 <<  8)                                                /* 100: Break field presence/absence select */
#define R_SCI_B_XCR0_CF0RE (1 <<  9)                                              /* 200: Control field 0 presence/absence select */
#define R_SCI_B_XCR0_CF1DS_SHIFT (10)
#define R_SCI_B_XCR0_CF1DS_MASK (0x3)
#  define R_SCI_B_XCR0_CF1DS_V00 (0 << R_SCI_B_XCR0_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_CF1DS_V01 (1 << R_SCI_B_XCR0_CF1DS_SHIFT)                  /* XCR1.SCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_CF1DS_V10 (2 << R_SCI_B_XCR0_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] and XCR1.SCF1D[7:0] are compare data */
#  define R_SCI_B_XCR0_CF1DS_PROHIBIT (3 << R_SCI_B_XCR0_CF1DS_SHIFT)             /* Prohibit */
#define R_SCI_B_XCR0_PIBE (1 << 12)                                               /* 1000: Priority Interrupt Bit Enable */
#define R_SCI_B_XCR0_PIBS_SHIFT (13)
#define R_SCI_B_XCR0_PIBS_MASK (0x7)
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_0 (0 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 0. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_1 (1 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 1. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_2 (2 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 2. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_3 (3 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 3. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_4 (4 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 4. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_5 (5 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 5. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_6 (6 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 6. */
#  define R_SCI_B_XCR0_PIBS_CONTROL_FIELD_1_BIT_7 (7 << R_SCI_B_XCR0_PIBS_SHIFT)  /* Control Field 1, bit 7. */
#define R_SCI_B_XCR0_BFOIE (1 << 16)                                              /* 10000: Break Filed Output end Interrupt Enable */
#define R_SCI_B_XCR0_BCDIE (1 << 17)                                              /* 20000: Bus Collision Detect Interrupt Enable */
#define R_SCI_B_XCR0_BFDIE (1 << 20)                                              /* 100000: Break Filed Detection Interrupt Enable */
#define R_SCI_B_XCR0_COFIE (1 << 21)                                              /* 200000: Counter Over Flow Interrupt Enable */
#define R_SCI_B_XCR0_AEDIE (1 << 22)                                              /* 400000: Active Edge Detection Interrupt Enable */
#define R_SCI_B_XCR0_BCCS_SHIFT (24)
#define R_SCI_B_XCR0_BCCS_MASK (0x3)
#  define R_SCI_B_XCR0_BCCS_RSCI_BASE_CLOCK (0 << R_SCI_B_XCR0_BCCS_SHIFT)        /* RSCI base clock */
#  define R_SCI_B_XCR0_BCCS_RSCI_BASE_CLOCK_2 (1 << R_SCI_B_XCR0_BCCS_SHIFT)      /* RSCI base clock/2 */
#  define R_SCI_B_XCR0_BCCS_RSCI_BASE_CLOCK_4 (2 << R_SCI_B_XCR0_BCCS_SHIFT)      /* RSCI base clock/4 */
#  define R_SCI_B_XCR0_BCCS_PROHIBIT (3 << R_SCI_B_XCR0_BCCS_SHIFT)               /* Prohibit */

/* Simple-LIN(SCIX) Control Register 0 (16-bits) ****************************/

