apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_XCR0_HA_L_TCSS_SHIFT (0)
#define R_SCI_B_XCR0_HA_L_TCSS_MASK (0x3)
#  define R_SCI_B_XCR0_HA_L_TCSS_TCLK (0 << R_SCI_B_XCR0_HA_L_TCSS_SHIFT)                   /* TCLK */
#  define R_SCI_B_XCR0_HA_L_TCSS_TCLK_4 (1 << R_SCI_B_XCR0_HA_L_TCSS_SHIFT)                 /* TCLK/4 */
#  define R_SCI_B_XCR0_HA_L_TCSS_TCLK_16 (2 << R_SCI_B_XCR0_HA_L_TCSS_SHIFT)                /* TCLK/16 */
#  define R_SCI_B_XCR0_HA_L_TCSS_TCLK_64 (3 << R_SCI_B_XCR0_HA_L_TCSS_SHIFT)                /* TCLK/64 */
#define R_SCI_B_XCR0_HA_L_BFE (1 <<  8)                                                     /* 100: Break field presence/absence select */
#define R_SCI_B_XCR0_HA_L_CF0RE (1 <<  9)                                                   /* 200: Control field 0 presence/absence select */
#define R_SCI_B_XCR0_HA_L_CF1DS_SHIFT (10)
#define R_SCI_B_XCR0_HA_L_CF1DS_MASK (0x3)
#  define R_SCI_B_XCR0_HA_L_CF1DS_V00 (0 << R_SCI_B_XCR0_HA_L_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_HA_L_CF1DS_V01 (1 << R_SCI_B_XCR0_HA_L_CF1DS_SHIFT)                  /* XCR1.SCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_HA_L_CF1DS_V10 (2 << R_SCI_B_XCR0_HA_L_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] and XCR1.SCF1D[7:0] are compare data */
#  define R_SCI_B_XCR0_HA_L_CF1DS_PROHIBIT (3 << R_SCI_B_XCR0_HA_L_CF1DS_SHIFT)             /* Prohibit */
#define R_SCI_B_XCR0_HA_L_PIBE (1 << 12)                                                    /* 1000: Priority Interrupt Bit Enable */
#define R_SCI_B_XCR0_HA_L_PIBS_SHIFT (13)
#define R_SCI_B_XCR0_HA_L_PIBS_MASK (0x7)
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_0 (0 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 0. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_1 (1 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 1. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_2 (2 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 2. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_3 (3 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 3. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_4 (4 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 4. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_5 (5 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 5. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_6 (6 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 6. */
#  define R_SCI_B_XCR0_HA_L_PIBS_CONTROL_FIELD_1_BIT_7 (7 << R_SCI_B_XCR0_HA_L_PIBS_SHIFT)  /* Control Field 1, bit 7. */

/* Simple-LIN(SCIX) Control Register 0 (8-bits) *****************************/

#define R_SCI_B_XCR0_BY_LL_TCSS_SHIFT (0)
#define R_SCI_B_XCR0_BY_LL_TCSS_MASK (0x3)
#  define R_SCI_B_XCR0_BY_LL_TCSS_TCLK (0 << R_SCI_B_XCR0_BY_LL_TCSS_SHIFT)     /* TCLK */
#  define R_SCI_B_XCR0_BY_LL_TCSS_TCLK_4 (1 << R_SCI_B_XCR0_BY_LL_TCSS_SHIFT)   /* TCLK/4 */
#  define R_SCI_B_XCR0_BY_LL_TCSS_TCLK_16 (2 << R_SCI_B_XCR0_BY_LL_TCSS_SHIFT)  /* TCLK/16 */
#  define R_SCI_B_XCR0_BY_LL_TCSS_TCLK_64 (3 << R_SCI_B_XCR0_BY_LL_TCSS_SHIFT)  /* TCLK/64 */

/* Simple-LIN(SCIX) Control Register 0 (8-bits) *****************************/

#define R_SCI_B_XCR0_BY_LH_BFE (1 <<  0)                                                      /* 01: Break field presence/absence select */
#define R_SCI_B_XCR0_BY_LH_CF0RE (1 <<  1)                                                    /* 02: Control field 0 presence/absence select */
#define R_SCI_B_XCR0_BY_LH_CF1DS_SHIFT (2)
#define R_SCI_B_XCR0_BY_LH_CF1DS_MASK (0x3)
#  define R_SCI_B_XCR0_BY_LH_CF1DS_V00 (0 << R_SCI_B_XCR0_BY_LH_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_BY_LH_CF1DS_V01 (1 << R_SCI_B_XCR0_BY_LH_CF1DS_SHIFT)                  /* XCR1.SCF1D[7:0] is compare data */
#  define R_SCI_B_XCR0_BY_LH_CF1DS_V10 (2 << R_SCI_B_XCR0_BY_LH_CF1DS_SHIFT)                  /* XCR1.PCF1D[7:0] and XCR1.SCF1D[7:0] are compare data */
#  define R_SCI_B_XCR0_BY_LH_CF1DS_PROHIBIT (3 << R_SCI_B_XCR0_BY_LH_CF1DS_SHIFT)             /* Prohibit */
#define R_SCI_B_XCR0_BY_LH_PIBE (1 <<  4)                                                     /* 10: Priority Interrupt Bit Enable */
#define R_SCI_B_XCR0_BY_LH_PIBS_SHIFT (5)
#define R_SCI_B_XCR0_BY_LH_PIBS_MASK (0x7)
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_0 (0 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 0. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_1 (1 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 1. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_2 (2 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 2. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_3 (3 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 3. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_4 (4 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 4. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_5 (5 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 5. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_6 (6 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 6. */
#  define R_SCI_B_XCR0_BY_LH_PIBS_CONTROL_FIELD_1_BIT_7 (7 << R_SCI_B_XCR0_BY_LH_PIBS_SHIFT)  /* Control Field 1, bit 7. */

/* Simple-LIN(SCIX) Control Register 0 (16-bits) ****************************/

#define R_SCI_B_XCR0_HA_H_BFOIE (1 <<  0)                                               /* 01: Break Filed Output end Interrupt Enable */
#define R_SCI_B_XCR0_HA_H_BCDIE (1 <<  1)                                               /* 02: Bus Collision Detect Interrupt Enable */
#define R_SCI_B_XCR0_HA_H_BFDIE (1 <<  4)                                               /* 10: Break Filed Detection Interrupt Enable */
#define R_SCI_B_XCR0_HA_H_COFIE (1 <<  5)                                               /* 20: Counter Over Flow Interrupt Enable */
#define R_SCI_B_XCR0_HA_H_AEDIE (1 <<  6)                                               /* 40: Active Edge Detection Interrupt Enable */
#define R_SCI_B_XCR0_HA_H_BCCS_SHIFT (8)
#define R_SCI_B_XCR0_HA_H_BCCS_MASK (0x3)
#  define R_SCI_B_XCR0_HA_H_BCCS_RSCI_BASE_CLOCK (0 << R_SCI_B_XCR0_HA_H_BCCS_SHIFT)    /* RSCI base clock */
#  define R_SCI_B_XCR0_HA_H_BCCS_RSCI_BASE_CLOCK_2 (1 << R_SCI_B_XCR0_HA_H_BCCS_SHIFT)  /* RSCI base clock/2 */
#  define R_SCI_B_XCR0_HA_H_BCCS_RSCI_BASE_CLOCK_4 (2 << R_SCI_B_XCR0_HA_H_BCCS_SHIFT)  /* RSCI base clock/4 */
#  define R_SCI_B_XCR0_HA_H_BCCS_PROHIBIT (3 << R_SCI_B_XCR0_HA_H_BCCS_SHIFT)           /* Prohibit */

/* Simple-LIN(SCIX) Control Register 0 (8-bits) *****************************/

