apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_XCR0_BY_HL_BFOIE (1 <<  0)  /* 01: Break Filed Output end Interrupt Enable */
#define R_SCI_B_XCR0_BY_HL_BCDIE (1 <<  1)  /* 02: Bus Collision Detect Interrupt Enable */
#define R_SCI_B_XCR0_BY_HL_BFDIE (1 <<  4)  /* 10: Break Filed Detection Interrupt Enable */
#define R_SCI_B_XCR0_BY_HL_COFIE (1 <<  5)  /* 20: Counter Over Flow Interrupt Enable */
#define R_SCI_B_XCR0_BY_HL_AEDIE (1 <<  6)  /* 40: Active Edge Detection Interrupt Enable */

/* Simple-LIN(SCIX) Control Register 0 (8-bits) *****************************/

#define R_SCI_B_XCR0_BY_HH_BCCS_SHIFT (0)
#define R_SCI_B_XCR0_BY_HH_BCCS_MASK (0x3)
#  define R_SCI_B_XCR0_BY_HH_BCCS_RSCI_BASE_CLOCK (0 << R_SCI_B_XCR0_BY_HH_BCCS_SHIFT)    /* RSCI base clock */
#  define R_SCI_B_XCR0_BY_HH_BCCS_RSCI_BASE_CLOCK_2 (1 << R_SCI_B_XCR0_BY_HH_BCCS_SHIFT)  /* RSCI base clock/2 */
#  define R_SCI_B_XCR0_BY_HH_BCCS_RSCI_BASE_CLOCK_4 (2 << R_SCI_B_XCR0_BY_HH_BCCS_SHIFT)  /* RSCI base clock/4 */
#  define R_SCI_B_XCR0_BY_HH_BCCS_PROHIBIT (3 << R_SCI_B_XCR0_BY_HH_BCCS_SHIFT)           /* Prohibit */

/* Simple-LIN(SCIX) Control Register 1 (32-bits) ****************************/

#define R_SCI_B_XCR1_TCST (1 <<  0)                              /* 01: break field Timer Count Start trigger */
#define R_SCI_B_XCR1_SDST (1 <<  4)                              /* 10: Start frame Detection Start trigger */
#define R_SCI_B_XCR1_BMEN (1 <<  5)                              /* 20: Bit rate Measurement function Enable */
#define R_SCI_B_XCR1_PCF1D_SHIFT (8)
#define R_SCI_B_XCR1_PCF1D_MASK (0xff)
#define R_SCI_B_XCR1_SCF1D_SHIFT (16)
#define R_SCI_B_XCR1_SCF1D_MASK (0xff)
#define R_SCI_B_XCR1_CF1CE_SHIFT (24)
#define R_SCI_B_XCR1_CF1CE_MASK (0xff)
#  define R_SCI_B_XCR1_CF1CE_V0 (0 << R_SCI_B_XCR1_CF1CE_SHIFT)  /* Bit N of control Field 1 is not for comparison */
#  define R_SCI_B_XCR1_CF1CE_V1 (1 << R_SCI_B_XCR1_CF1CE_SHIFT)  /* Bit N of control Field 1 is for comparison */

/* Simple-LIN(SCIX) Control Register 1 (16-bits) ****************************/

#define R_SCI_B_XCR1_HA_L_TCST (1 <<  0)  /* 01: break field Timer Count Start trigger */
#define R_SCI_B_XCR1_HA_L_SDST (1 <<  4)  /* 10: Start frame Detection Start trigger */
#define R_SCI_B_XCR1_HA_L_BMEN (1 <<  5)  /* 20: Bit rate Measurement function Enable */
#define R_SCI_B_XCR1_HA_L_PCF1D_SHIFT (8)
#define R_SCI_B_XCR1_HA_L_PCF1D_MASK (0xff)

/* Simple-LIN(SCIX) Control Register 1 (8-bits) *****************************/

#define R_SCI_B_XCR1_BY_LL_TCST (1 <<  0)  /* 01: break field Timer Count Start trigger */
#define R_SCI_B_XCR1_BY_LL_SDST (1 <<  4)  /* 10: Start frame Detection Start trigger */
#define R_SCI_B_XCR1_BY_LL_BMEN (1 <<  5)  /* 20: Bit rate Measurement function Enable */

/* Simple-LIN(SCIX) Control Register 1 (8-bits) *****************************/

#define R_SCI_B_XCR1_BY_LH_PCF1D_SHIFT (0)
#define R_SCI_B_XCR1_BY_LH_PCF1D_MASK (0xff)

/* Simple-LIN(SCIX) Control Register 1 (16-bits) ****************************/

#define R_SCI_B_XCR1_HA_H_SCF1D_SHIFT (0)
#define R_SCI_B_XCR1_HA_H_SCF1D_MASK (0xff)
#define R_SCI_B_XCR1_HA_H_CF1CE_SHIFT (8)
#define R_SCI_B_XCR1_HA_H_CF1CE_MASK (0xff)
#  define R_SCI_B_XCR1_HA_H_CF1CE_V0 (0 << R_SCI_B_XCR1_HA_H_CF1CE_SHIFT)  /* Bit N of control Field 1 is not for comparison */
#  define R_SCI_B_XCR1_HA_H_CF1CE_V1 (1 << R_SCI_B_XCR1_HA_H_CF1CE_SHIFT)  /* Bit N of control Field 1 is for comparison */

/* Simple-LIN(SCIX) Control Register 1 (8-bits) *****************************/

#define R_SCI_B_XCR1_BY_HL_SCF1D_SHIFT (0)
#define R_SCI_B_XCR1_BY_HL_SCF1D_MASK (0xff)

/* Simple-LIN(SCIX) Control Register 1 (8-bits) *****************************/

#define R_SCI_B_XCR1_BY_HH_CF1CE_SHIFT (0)
#define R_SCI_B_XCR1_BY_HH_CF1CE_MASK (0xff)
#  define R_SCI_B_XCR1_BY_HH_CF1CE_V0 (0 << R_SCI_B_XCR1_BY_HH_CF1CE_SHIFT)  /* Bit N of control Field 1 is not for comparison */
#  define R_SCI_B_XCR1_BY_HH_CF1CE_V1 (1 << R_SCI_B_XCR1_BY_HH_CF1CE_SHIFT)  /* Bit N of control Field 1 is for comparison */

/* Simple-LIN(SCIX) Control Register 2 (32-bits) ****************************/

#define R_SCI_B_XCR2_CF0D_SHIFT (0)
#define R_SCI_B_XCR2_CF0D_MASK (0xff)
#define R_SCI_B_XCR2_CF0CE_SHIFT (8)
#define R_SCI_B_XCR2_CF0CE_MASK (0xff)
#  define R_SCI_B_XCR2_CF0CE_V0 (0 << R_SCI_B_XCR2_CF0CE_SHIFT)  /* Bit N of control Field 0 is not for comparison */
#  define R_SCI_B_XCR2_CF0CE_V1 (1 << R_SCI_B_XCR2_CF0CE_SHIFT)  /* Bit N of control Field 0 is for comparison */
#define R_SCI_B_XCR2_BFLW_SHIFT (16)
#define R_SCI_B_XCR2_BFLW_MASK (0xffff)

/* Simple-LIN(SCIX) Control Register 2 (16-bits) ****************************/

#define R_SCI_B_XCR2_HA_L_CF0D_SHIFT (0)
#define R_SCI_B_XCR2_HA_L_CF0D_MASK (0xff)
#define R_SCI_B_XCR2_HA_L_CF0CE_SHIFT (8)
#define R_SCI_B_XCR2_HA_L_CF0CE_MASK (0xff)
#  define R_SCI_B_XCR2_HA_L_CF0CE_V0 (0 << R_SCI_B_XCR2_HA_L_CF0CE_SHIFT)  /* Bit N of control Field 0 is not for comparison */
#  define R_SCI_B_XCR2_HA_L_CF0CE_V1 (1 << R_SCI_B_XCR2_HA_L_CF0CE_SHIFT)  /* Bit N of control Field 0 is for comparison */

/* Simple-LIN(SCIX) Control Register 2 (8-bits) *****************************/

#define R_SCI_B_XCR2_BY_LL_CF0D_SHIFT (0)
#define R_SCI_B_XCR2_BY_LL_CF0D_MASK (0xff)

/* Simple-LIN(SCIX) Control Register 2 (8-bits) *****************************/

#define R_SCI_B_XCR2_BY_LH_CF0CE_SHIFT (0)
#define R_SCI_B_XCR2_BY_LH_CF0CE_MASK (0xff)
#  define R_SCI_B_XCR2_BY_LH_CF0CE_V0 (0 << R_SCI_B_XCR2_BY_LH_CF0CE_SHIFT)  /* Bit N of control Field 0 is not for comparison */
#  define R_SCI_B_XCR2_BY_LH_CF0CE_V1 (1 << R_SCI_B_XCR2_BY_LH_CF0CE_SHIFT)  /* Bit N of control Field 0 is for comparison */

/* Simple-LIN(SCIX) Control Register 2 (16-bits) ****************************/

#define R_SCI_B_XCR2_HA_H_BFLW_SHIFT (0)
#define R_SCI_B_XCR2_HA_H_BFLW_MASK (0xffff)

/* Simple-LIN(SCIX) Control Register 2 (8-bits) *****************************/

#define R_SCI_B_XCR2_BY_HL_BFLW_SHIFT (0)
#define R_SCI_B_XCR2_BY_HL_BFLW_MASK (0xff)

/* Simple-LIN(SCIX) Control Register 2 (8-bits) *****************************/

#define R_SCI_B_XCR2_BY_HH_BFLW_SHIFT (0)
#define R_SCI_B_XCR2_BY_HH_BFLW_MASK (0xff)

/* Common Status Register (32-bits) *****************************************/

