apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_CSR_ERS (1 <<  4)     /* 10: Error Signal Status Flag */
#define R_SCI_B_CSR_RxDMON (1 << 15)  /* 8000: Serial input data monitor bit */
#define R_SCI_B_CSR_DCMF (1 << 16)    /* 10000: Data Compare Match Flag */
#define R_SCI_B_CSR_DPER (1 << 17)    /* 20000: Data Compare Match Parity Error Flag */
#define R_SCI_B_CSR_DFER (1 << 18)    /* 40000: Data Compare Match Framing Error Flag */
#define R_SCI_B_CSR_ORER (1 << 24)    /* 1000000: Overrun Error Flag */
#define R_SCI_B_CSR_MFF (1 << 26)     /* 4000000: Mode Fault Flag */
#define R_SCI_B_CSR_PER (1 << 27)     /* 8000000: Parity Error Flag */
#define R_SCI_B_CSR_FER (1 << 28)     /* 10000000: Framing Error Flag */
#define R_SCI_B_CSR_TDRE (1 << 29)    /* 20000000: Transmit Data Empty Flag */
#define R_SCI_B_CSR_TEND (1 << 30)    /* 40000000: Transmit End Flag */
#define R_SCI_B_CSR_RDRF (1 << 31)    /* 80000000: Receive Data Full Flag */

/* Simple-I2C Status Register (32-bits) *************************************/

#define R_SCI_B_ISR_IICACKR (1 <<  0)  /* 01: ACK Reception Data Flag */
#define R_SCI_B_ISR_IICBBS (1 <<  2)   /* 04: Bus busy flag. */
#define R_SCI_B_ISR_IICSTIF (1 <<  3)  /* 08: Issuing of Start, Restart, or Stop Condition Completed Flag */
#define R_SCI_B_ISR_IICSDAI (1 <<  4)  /* 10: SDA input monitor bit. */
#define R_SCI_B_ISR_IICSCLI (1 <<  5)  /* 20: SCL input monitor bit */

/* FIFO Receive Status Register (32-bits) ***********************************/

#define R_SCI_B_FRSR_DR (1 <<  0)   /* 01: Receive Data Ready flag */
#define R_SCI_B_FRSR_BRK (1 <<  1)  /* 02: Break detection signal flag */
#define R_SCI_B_FRSR_R_SHIFT (8)
#define R_SCI_B_FRSR_R_MASK (0x3f)
#define R_SCI_B_FRSR_PNUM_SHIFT (16)
#define R_SCI_B_FRSR_PNUM_MASK (0x3f)
#define R_SCI_B_FRSR_FNUM_SHIFT (24)
#define R_SCI_B_FRSR_FNUM_MASK (0x3f)

/* FIFO Transmit Status Register (32-bits) **********************************/

#define R_SCI_B_FTSR_T_SHIFT (0)
#define R_SCI_B_FTSR_T_MASK (0x3f)

/* Manchester Status Register (32-bits) *************************************/

#define R_SCI_B_MSR_PFER (1 <<  0)   /* 01: Preface Error Register */
#define R_SCI_B_MSR_SYER (1 <<  1)   /* 02: Sync Error Register */
#define R_SCI_B_MSR_SBER (1 <<  2)   /* 04: Start bit Error Register */
#define R_SCI_B_MSR_MER (1 <<  4)    /* 10: Manchester error flag */
#define R_SCI_B_MSR_RSYNC (1 <<  6)  /* 40: Receive sync data bit. */

/* Simple-LIN(SCIX) Status Register 0 (32-bits) *****************************/

#define R_SCI_B_XSR0_SFSF (1 <<  0)   /* 01: Start Frame Status Flag */
#define R_SCI_B_XSR0_RXDSF (1 <<  1)  /* 02: RXD input Status Flag */
#define R_SCI_B_XSR0_BFOF (1 <<  8)   /* 100: Break Field Output end Flag */
#define R_SCI_B_XSR0_BCDF (1 <<  9)   /* 200: Bus Collision Detection Flag */
#define R_SCI_B_XSR0_BFDF (1 << 10)   /* 400: Break Field Detection Flag */
#define R_SCI_B_XSR0_CF0MF (1 << 11)  /* 800: Control Field 0 Match Flag */
#define R_SCI_B_XSR0_CF1MF (1 << 12)  /* 1000: Control Field 1 Match Flag */
#define R_SCI_B_XSR0_PIBDF (1 << 13)  /* 2000: Priority Interrupt Bit Detection Flag */
#define R_SCI_B_XSR0_COF (1 << 14)    /* 4000: Counter Over flow Flag */
#define R_SCI_B_XSR0_AEDF (1 << 15)   /* 8000: Active Edge Detection Flag */
#define R_SCI_B_XSR0_CF0RD_SHIFT (16)
#define R_SCI_B_XSR0_CF0RD_MASK (0xff)
#define R_SCI_B_XSR0_CF1RD_SHIFT (24)
#define R_SCI_B_XSR0_CF1RD_MASK (0xff)

/* Simple-LIN(SCIX) Status Register 1 (32-bits) *****************************/

#define R_SCI_B_XSR1_TCNT_SHIFT (0)
#define R_SCI_B_XSR1_TCNT_MASK (0xffff)

/* Common Flag Clear Register (32-bits) *************************************/

#define R_SCI_B_CFCLR_ERSC (1 <<  4)   /* 10: ERS Clear bit */
#define R_SCI_B_CFCLR_DCMFC (1 << 16)  /* 10000: DCMF Clear bit */
#define R_SCI_B_CFCLR_DPERC (1 << 17)  /* 20000: DPER Clear bit */
#define R_SCI_B_CFCLR_DFERC (1 << 18)  /* 40000: DFER Clear bit */
#define R_SCI_B_CFCLR_ORERC (1 << 24)  /* 1000000: ORER Clear bit */
#define R_SCI_B_CFCLR_MFFC (1 << 26)   /* 4000000: MFF Clear bit */
#define R_SCI_B_CFCLR_PERC (1 << 27)   /* 8000000: PER Clear bit */
#define R_SCI_B_CFCLR_FERC (1 << 28)   /* 10000000: FER Clear bit */
#define R_SCI_B_CFCLR_TDREC (1 << 29)  /* 20000000: TDRE Clear bit */
#define R_SCI_B_CFCLR_RDRFC (1 << 31)  /* 80000000: RDRF Clear bit */

/* Common Flag Clear Register (16-bits) *************************************/

#define R_SCI_B_CFCLR_HA_L_ERSC (1 <<  4)  /* 10: ERS Clear bit */

/* Common Flag Clear Register (8-bits) **************************************/

#define R_SCI_B_CFCLR_BY_LL_ERSC (1 <<  4)  /* 10: ERS Clear bit */

/* Common Flag Clear Register (16-bits) *************************************/

#define R_SCI_B_CFCLR_HA_H_DCMFC (1 <<  0)  /* 01: DCMF Clear bit */
#define R_SCI_B_CFCLR_HA_H_DPERC (1 <<  1)  /* 02: DPER Clear bit */
#define R_SCI_B_CFCLR_HA_H_DFERC (1 <<  2)  /* 04: DFER Clear bit */
#define R_SCI_B_CFCLR_HA_H_ORERC (1 <<  8)  /* 100: ORER Clear bit */
#define R_SCI_B_CFCLR_HA_H_MFFC (1 << 10)   /* 400: MFF Clear bit */
#define R_SCI_B_CFCLR_HA_H_PERC (1 << 11)   /* 800: PER Clear bit */
#define R_SCI_B_CFCLR_HA_H_FERC (1 << 12)   /* 1000: FER Clear bit */
#define R_SCI_B_CFCLR_HA_H_TDREC (1 << 13)  /* 2000: TDRE Clear bit */
#define R_SCI_B_CFCLR_HA_H_RDRFC (1 << 15)  /* 8000: RDRF Clear bit */

/* Common Flag Clear Register (8-bits) **************************************/

#define R_SCI_B_CFCLR_BY_HL_DCMFC (1 <<  0)  /* 01: DCMF Clear bit */
#define R_SCI_B_CFCLR_BY_HL_DPERC (1 <<  1)  /* 02: DPER Clear bit */
#define R_SCI_B_CFCLR_BY_HL_DFERC (1 <<  2)  /* 04: DFER Clear bit */

/* Common Flag Clear Register (8-bits) **************************************/

#define R_SCI_B_CFCLR_BY_HH_ORERC (1 <<  0)  /* 01: ORER Clear bit */
#define R_SCI_B_CFCLR_BY_HH_MFFC (1 <<  2)   /* 04: MFF Clear bit */
#define R_SCI_B_CFCLR_BY_HH_PERC (1 <<  3)   /* 08: PER Clear bit */
#define R_SCI_B_CFCLR_BY_HH_FERC (1 <<  4)   /* 10: FER Clear bit */
#define R_SCI_B_CFCLR_BY_HH_TDREC (1 <<  5)  /* 20: TDRE Clear bit */
#define R_SCI_B_CFCLR_BY_HH_RDRFC (1 <<  7)  /* 80: RDRF Clear bit */

/* Simple-I2C Flag Clear Register (32-bits) *********************************/

#define R_SCI_B_ICFCLR_IICBBSC (1 <<  2)   /* 04: IICBBS Clear bit */
#define R_SCI_B_ICFCLR_IICSTIFC (1 <<  3)  /* 08: IICSTIF Clear bit */

/* Simple-I2C Flag Clear Register (16-bits) *********************************/

#define R_SCI_B_ICFCLR_HA_L_IICBBSC (1 <<  2)   /* 04: IICBBSC Clear bit */
#define R_SCI_B_ICFCLR_HA_L_IICSTIFC (1 <<  3)  /* 08: IICSTIF Clear bit */

/* Simple-I2C Flag Clear Register (8-bits) **********************************/

#define R_SCI_B_ICFCLR_BY_LL_IICBBSC (1 <<  2)   /* 04: IICBBSC Clear bit */
#define R_SCI_B_ICFCLR_BY_LL_IICSTIFC (1 <<  3)  /* 08: IICSTIF Clear bit */

/* FIFO Flag Clear Register (32-bits) ***************************************/

#define R_SCI_B_FFCLR_DRC (1 <<  0)   /* 01: DR Clear bit */
#define R_SCI_B_FFCLR_BRKC (1 <<  1)  /* 02: BRK Clear bit */

/* FIFO Flag Clear Register (16-bits) ***************************************/

#define R_SCI_B_FFCLR_HA_L_DRC (1 <<  0)   /* 01: DR Clear bit */
#define R_SCI_B_FFCLR_HA_L_BRKC (1 <<  1)  /* 02: BRK Clear bit */

/* FIFO Flag Clear Register (8-bits) ****************************************/

