apache/nuttx/arch/arm/src/ra8m1/hardware/ra8m1_sci.h
#define R_SCI_B_FFCLR_BY_LL_DRC (1 <<  0)   /* 01: DR Clear bit */
#define R_SCI_B_FFCLR_BY_LL_BRKC (1 <<  1)  /* 02: BRK Clear bit */

/* Manchester Flag Clear Register (32-bits) *********************************/

#define R_SCI_B_MFCLR_PFERC (1 <<  0)  /* 01: PFER Clear bit */
#define R_SCI_B_MFCLR_SYERC (1 <<  1)  /* 02: SYER Clear bit */
#define R_SCI_B_MFCLR_SBERC (1 <<  2)  /* 04: SBER Clear bit */
#define R_SCI_B_MFCLR_MERC (1 <<  4)   /* 10: MER Clear bit */

/* Manchester Flag Clear Register (16-bits) *********************************/

#define R_SCI_B_MFCLR_HA_L_PFERC (1 <<  0)  /* 01: PFER Clear bit */
#define R_SCI_B_MFCLR_HA_L_SYERC (1 <<  1)  /* 02: SYER Clear bit */
#define R_SCI_B_MFCLR_HA_L_SBERC (1 <<  2)  /* 04: SBER Clear bit */
#define R_SCI_B_MFCLR_HA_L_MERC (1 <<  4)   /* 10: MER Clear bit */

/* Manchester Flag Clear Register (8-bits) **********************************/

#define R_SCI_B_MFCLR_BY_LL_PFERC (1 <<  0)  /* 01: PFER Clear bit */
#define R_SCI_B_MFCLR_BY_LL_SYERC (1 <<  1)  /* 02: SYER Clear bit */
#define R_SCI_B_MFCLR_BY_LL_SBERC (1 <<  2)  /* 04: SBER Clear bit */
#define R_SCI_B_MFCLR_BY_LL_MERC (1 <<  4)   /* 10: MER Clear bit */

/* Simpe-LIN(SCIX) Flag Clear Register (32-bits) ****************************/

#define R_SCI_B_XFCLR_BFOC (1 <<  8)   /* 100: BFO Clear bit */
#define R_SCI_B_XFCLR_BCDC (1 <<  9)   /* 200: BCD Clear bit */
#define R_SCI_B_XFCLR_BFDC (1 << 10)   /* 400: BFD Clear bit */
#define R_SCI_B_XFCLR_CF0MC (1 << 11)  /* 800: CF0M Clear bit */
#define R_SCI_B_XFCLR_CF1MC (1 << 12)  /* 1000: CF1M Clear bit */
#define R_SCI_B_XFCLR_PIBDC (1 << 13)  /* 2000: PIBD Clear bit */
#define R_SCI_B_XFCLR_COFC (1 << 14)   /* 4000: COF Clear bit */
#define R_SCI_B_XFCLR_AEDC (1 << 15)   /* 8000: AED Clear bit */

/* Simpe-LIN(SCIX) Flag Clear Register (16-bits) ****************************/

#define R_SCI_B_XFCLR_HA_L_BFOC (1 <<  8)   /* 100: BFO Clear bit */
#define R_SCI_B_XFCLR_HA_L_BCDC (1 <<  9)   /* 200: BCD Clear bit */
#define R_SCI_B_XFCLR_HA_L_BFDC (1 << 10)   /* 400: BFD Clear bit */
#define R_SCI_B_XFCLR_HA_L_CF0MC (1 << 11)  /* 800: CF0M Clear bit */
#define R_SCI_B_XFCLR_HA_L_CF1MC (1 << 12)  /* 1000: CF1M Clear bit */
#define R_SCI_B_XFCLR_HA_L_PIBDC (1 << 13)  /* 2000: PIBD Clear bit */
#define R_SCI_B_XFCLR_HA_L_COFC (1 << 14)   /* 4000: COF Clear bit */
#define R_SCI_B_XFCLR_HA_L_AEDC (1 << 15)   /* 8000: AED Clear bit */

/* Simpe-LIN(SCIX) Flag Clear Register (8-bits) *****************************/

#define R_SCI_B_XFCLR_BY_LH_BFOC (1 <<  0)   /* 01: BFO Clear bit */
#define R_SCI_B_XFCLR_BY_LH_BCDC (1 <<  1)   /* 02: BCD Clear bit */
#define R_SCI_B_XFCLR_BY_LH_BFDC (1 <<  2)   /* 04: BFD Clear bit */
#define R_SCI_B_XFCLR_BY_LH_CF0MC (1 <<  3)  /* 08: CF0M Clear bit */
#define R_SCI_B_XFCLR_BY_LH_CF1MC (1 <<  4)  /* 10: CF1M Clear bit */
#define R_SCI_B_XFCLR_BY_LH_PIBDC (1 <<  5)  /* 20: PIBD Clear bit */
#define R_SCI_B_XFCLR_BY_LH_COFC (1 <<  6)   /* 40: COF Clear bit */
#define R_SCI_B_XFCLR_BY_LH_AEDC (1 <<  7)   /* 80: AED Clear bit */

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ARCH_ARM_SRC_RA8M1_HARDWARE_RA8M1_SCI_H */
